Repository: prologin/concours-site
Catalog: prologin/locale/*/LC_MESSAGES/django.po
Languages: fr

source: The regional events allow the 100 best contestants to qualify for the final. The event lasts one day and takes place on a Saturday in January or February, depending on the city. Candidates are divided into various sessions in different examination centers all across France. The evaluation is based on three tests: a written exam on an original algorithmic problem, some unrelated problems to solve on the computer and an interview with one of Prologin's staff members.
fr: Les épreuves régionales permettent aux 100 meilleurs participants de se qualifier pour la finale. L'événement dure une journée et se déroule un samedi en janvier ou février, en fonction des villes. Les participants sont répartis dans les différents centres d'examens en France. La sélection se base sur trois épreuves : un examen écrit sur un problème d'algorithmique original, des exercices à résoudre sur ordinateur et un entretien avec un membre de l'association Prologin.

source: Where can I sit for the exam?
fr: Où puis-je passer l'épreuve ?

source: We organize the event in major cities across metropolitan France. You can check the nearest location using the <a href="%(url_centers)s">map of exam centers</a>.
fr: Nous organisons l'événement dans plusieurs grandes villes de France métropolitaine. Vous pouvez trouver l'endroit le plus proche en utilisant <a href="%(url_centers)s">la carte des centres</a>.

source: 3<sup>rd</sup> step – The Final
fr: 3<sup>e</sup> étape – La finale

source: The final takes place over three days in Paris, usually at the end of April. Candidates have to program an artificial intelligence of their own for a custom-made game, in just 36 hours. All the candidate submissions are assessed by competing against each other using an automated match-making system. It is also a unique opportunity to meet other computer enthusiasts, in a cheerful and relaxed mood!
fr: La finale se déroule sur 3 jours à Paris, habituellement fin avril. Les candidats doivent coder leur propre intelligence artificielle pour un jeu créé pour l'occasion, en seulement 36h. Les programmes des candidats sont ensuite confrontés les uns aux autres dans un tournoi automatisé. C'est aussi une opportunité unique de rencontrer des passionnés d'informatique dans une ambiance sympathique et détendue !

source: How much does it cost?
fr: Combien ça coûte&nbsp;?

source: All candidates are provided with free meals and a place to rest and sleep for the duration of the final. You only have to handle the cost of transportation.
fr: Durant toute la durée de la finale, les repas sont pris en charge et des salles de repos sont mises à disposition des candidats. Seuls les frais de transport restent à votre charge.

source: Contribute
fr: Contribuer

source: How to contribute to Prologin
fr: Contribuer à Prologin

source: There are many ways to contribute to the organization, on multiple levels:
fr: Il y a plusieurs manières de contribuer à l'association, à différents niveaux :

source: Contributor
fr: Contributeur

source: Many former contestants want to contribute to Prologin usually by writing exercises, but without joining the organization (which calls for further time investment). You can read our <a href="https://github.com/prologin/ressources-contributeurs">public resources</a> to understand how we create exercises for our platform.
fr: De nombreux anciens candidats veulent contribuer à Prologin en écrivant des sujets et exercices, mais sans pour autant rejoindre l'association (qui demande un investissement régulier tout au long de l'année). Vous pouvez lire nos <a href="https://github.com/prologin/ressources-contributeurs">ressources contributeurs</a> afin de comprendre comment nous créons des exercices pour la plateforme de Prologin.

source: If you are interested in helping us creating cool exercises, do not hesitate to send an email at: <a href="mailto:info@prologin.org">info@prologin.org</a>.
fr: Si vous avez envie de nous aider parce que vous avez une idée d'exercice sympa, n'hésitez pas à nous envoyer un mail à : <a href="mailto:info@prologin.org">info@prologin.org</a>.

source: Member
fr: Membre

source: Becoming a member means an ongoing investment, not only with exercises, but also on our multiple needs (coming to meetings, helping on logistic, internal tools, etc.). As a member, you can help in domains such as: <ul> <li>algorithms: creating written and machine exercises.</li> <li>system administration: maintaining and coding our infrastructure for regional and finals events.</li> <li>web development: for our own websites.</li> </ul> Prologin also has some non-technical necessities including logistics, sponsoring, and communication.
fr: Être membre de l'association demande de s'investir régulièrement, et pas uniquement sur la rédaction d'exercices mais sur divers aspects de l'organisation (assister aux réunions, aider sur la logistique, les outils internes, etc.). D'un point de vue technique il y a plusieurs domaines dans lesquels vous pouvez contribuer : <ul> <li>algorithmique : rédaction de sujets machines et écrits.</li> <li>administration système : maintien et développement des infrastructures des épreuves régionales et de finale.</li> <li>développement web : pour nos sites.</li> </ul> Mais pas besoin d'être un expert en algo ou en système pour nous rejoindre ! D'autant plus que les activités de l'association ne sont pas exclusivement techniques : logistique, contact de sponsors, communication et événementiel.

source: We have a lot to do, hence we need motivated people every year! If you want to join in, or if you have any question, feel free to write to us: <a href="mailto:info@prologin.org">info@prologin.org</a>.
fr: Nous avons énormément à faire et avons besoin chaque année de personnes motivées ! Si vous êtes tenté, (ou si vous avez des questions) envoyez nous un mail à : <a href="mailto:info@prologin.org">info@prologin.org</a>.

source: Our internal tools
fr: Nos outils internes

source: Whether you are a contributor, member, or simply curious, you can always take a look and contribute to our open source internal tools: <ul> <li><a href="https://github.com/prologin/camisole">camisole</a>: secure online judge.</li> <li><a href="https://github.com/prologin/stechec2">stechec2</a>: AI match maker for the finals.</li> <li><a href="https://github.com/prologin/sadm">sadm</a>: finals technical infrastructure.</li> <li><a href="https://github.com/prologin/metalang">metalang</a>: generate code stubs.</li> </ul> As an example, Haskell and Rust programming languages have been added by Prologin finalists so they could use it during the finals!
fr: Que vous soyez contributeur, membre ou juste curieux, il est toujours possible de participer au développement des outils internes de Prologin : <ul> <li><a href="https://github.com/prologin/camisole">camisole</a> : juge en ligne sécurisé.</li> <li><a href="https://github.com/prologin/stechec2">stechec2</a> : système de match pour la finale.</li> <li><a href="https://github.com/prologin/sadm">sadm</a> : infrastructure système de la finale.</li> <li><a href="https://github.com/prologin/metalang">metalang</a> : générateur de code à compléter.</li> </ul> Les langages Haskell et Rust ont par exemple été ajoutés par des finalistes Prologin pour qu'ils puissent eux-mêmes les utiliser lors d'une finale !

source: However, there is no need to code or join the organization to help us out. Simply talking about Prologin around you, or displaying our posters in your school means a lot!
fr: Toutefois, vous n'êtes pas obligé de coder ou de rejoindre l'association pour nous aider. Simplement parler de Prologin autour de soi, ou coller nos affiches dans votre école nous aide énormément !

source: The final
fr: La finale

source: A 36-hour nonstop contest
fr: Une épreuve de programmation de 36 heures non-stop

source: The final takes place for three days in the EPITA school, which is closed for the event. The Prologin team is assisted by some EPITA students and former contestants. At least ten organizers assist technically the contestants during the whole contest. The contestants are authorized (and invited) to communicate together.
fr: La finale se déroule pendant trois jours dans les locaux de l'EPITA, qui sont réservés au concours durant cette période. L'équipe de Prologin est complétée par des élèves d'EPITA et des anciens candidats, pour réunir un minimum de 30 personnes. Une dizaine d'organisateurs s'occupe d'assister techniquement les candidats tout au long de l'épreuve. Ces derniers sont également autorisés (pour ne pas dire incités) à communiquer entre eux.

source: Day 1
fr: Journée 1

source: Day 2
fr: Journée 2

source: Day 3
fr: Journée 3

source: Day 4
fr: Journée 4

source: Candidates reception
fr: Accueil des candidats

source: <tspan x="65" >Statement</tspan><tspan x="65" dy="15">distribution</tspan>
fr: <tspan x="65" >Distribution</tspan><tspan x="65" dy="15">du sujet</tspan>

source: <tspan x="390" >Selection,</tspan><tspan x="390" dy="15">jury</tspan>
fr: <tspan x="390" >Sélection,</tspan><tspan x="390" dy="15">jury</tspan>

source: <tspan x="470">Award ceremony,</tspan><tspan x="470" dy="15">banquet</tspan>
fr: <tspan x="470">Cérémonie,</tspan><tspan x="470" dy="15">banquet</tspan>

source: The main goal of the final is of course to select the best contestants, but also to allow them to meet together and share their knowledge and ideas, and to work on a real project that requires them to give the best of themselves, from a technical perspective but also from a time management perspective.
fr: L'objectif principal de la finale est bien sûr de sélectionner les meilleurs candidats, mais aussi de leur permettre de se rencontrer, d'échanger des idées, et de travailler sur un véritable projet qui leur demande de donner le meilleur d'eux-mêmes, d'une part du point de vue informatique, et d'autre part du point de vue de leur organisation et de la gestion du temps.

source: The judging system is a client-server architecture programmed every year by the Prologin team. The contestant being free of the systems programming part, they can focuse on all the algorithmic aspects of his submission.
fr: L'architecture d'évaluation est un système client-serveur réalisé chaque année par l'équipe Prologin. Le candidat étant affranchi de toute la partie programmation système, il peut se concentrer sur les aspects algorithmiques.

source: Logistics
fr: Logistique

source: Prologin takes care of the breakfasts, lunches and dinners. As the final is also a party, unlimited (alcohol-free) drinks, crepes and cotton candy are available, even after the meal hours.
fr: Prologin assure un service de restauration matin, midi et soir. Mais parce que la finale est aussi une fête, boissons (sans alcool), crêpes et barbe-à-papa sont à disposition des candidats à volonté, y compris en dehors des heures de repas.

source: Mattresses are of course available for every contestant, but they need to bring their own sleeping bags.
fr: Des matelas sont bien sûr disponibles pour chaque candidat, mais chacun doit néanmoins apporter son sac de couchage.

source: The development environment
fr: L'environnement de développement

source: Every one of the 100 contestants can work during the whole contest on a computer running GNU/Linux. It is a good occasion for them to familiarize with the UNIX environment, unknown for most of them. Some documentation on the subject is available, and the Prologin team is there to help them if needed.
fr: Chacun des 100 candidats se voit attribuer pour toute la durée du concours un ordinateur tournant sous GNU/Linux. C'est l'occasion pour les candidats de se familiariser avec l'environnement UNIX, méconnu d'une grande partie d'entre eux. Diverses documentations à ce sujet leur sont bien sûr fournies, et tout au long de l'épreuve l'équipe de Prologin est là pour les aider si besoin est.

source: The statement
fr: Le sujet

source: Every year, an original contest statement is created by the Prologin team. It generally consists of a game whose rules define a world in which the programs of the contestants have to compete. It has a playful aspect, while needing a lot of algorithmic and technical skills, generally related to artificial intelligence.
fr: Chaque année, un sujet original est conçu par l'équipe Prologin. Il s'agit généralement d'un jeu dont les règles définissent un monde dans lequel les programmes des candidats doivent s'affronter les uns aux autres. Il présente donc un aspect ludique, tout en faisant appel à de nombreux problèmes algorithmiques, orientés vers l'intelligence artificielle.

source: The complex environment of the subject requires technical skills, an analytical mind, and good time management.
fr: L'environnement complexe du sujet leur demande de faire preuve, en plus de leurs compétences techniques, d'un esprit de synthèse, et d'une bonne capacité à gérer leur temps.

source: Evaluation methodology
fr: Méthode d'évaluation

source: The first phase of the evaluation consists of a great tournament during which the programs of all the contestants compete against one another. As soon as the contest ends, at 1 AM, all the computers are used by a distributed tournament system, in order to make thousands of matches, and get a precise ranking in equitable conditions.
fr: La première phase de l'évaluation consiste en un grand tournoi, au cours duquel les programmes de tous les candidats vont s'affronter les uns aux autres. Dès la fin de l'épreuve, vers 1h du matin, toutes les machines sont exploitées par un système de tournoi réparti, afin de réaliser des dizaines de milliers de matchs, et obtenir ainsi un classement très précis dans les conditions les plus équitables possibles.

source: The ten best programs of this tournament are then analyzed in depth: the source code and the documentation provided by the contestant are studied to write an evaluation sheet that will be used during the defense.
fr: Les dix meilleurs projets issus de ce tournoi sont ensuite analysés plus en profondeur : le code source et la documentation fournis par le candidat sont étudiés pour constituer une fiche d'évaluation détaillée qui servira de base au déroulement de la soutenance.

source: A special jury defines the final ranking after a twenty-minutes defense with each of the ten best contestants. This ranking, highly influenced by the results of the tournament, also takes into account the capacity of the contestant to justify their technical choices, the quality of the design of his program and the potential improvements they could have worked on.
fr: Un jury définit le classement final après un entretien de vingt minutes avec chacun des dix candidats sélectionnés. Ce classement, fortement influencé par le résultat du tournoi, tient aussi compte entre autres de la capacité de chaque candidat à justifier ses choix techniques, de la qualité de l'architecture de son projet, et des possibilités d'améliorations envisagées.

source: Award ceremony
fr: Remise des prix

source: The awards are given at noon, after the individual defenses. The main sponsors are generally here and give prizes and awards to the winning contestants. Everyone is then invited to a feast that ends the contest.
fr: La remise des prix a lieu vers midi, après la fin des soutenances. Les principaux sponsors et un certain nombre de personnalités associées au concours sont généralement présents, et remettent les lots et trophées aux gagnants. Tout le monde est ensuite convié au banquet qui clôture le concours.

source: History
fr: Historique

source: The creation of the contest
fr: La création du concours

source: The Prologin organization was created in 1991 by EPITA and École polytechnique students, finding that Computer Science was one of the few fields for which there was no national contest in France gathering young enthusiasts.
fr: L'association Prologin est née en 1991 de l'initiative d'étudiants l'EPITA et de l'École polytechnique, constatant que l'informatique était l'un des rares domaines pour lequel il n'existait en France aucun concours réunissant des jeunes passionnés par cette matière.

source: The first Prologin edition was done in 1992, taking the form of a national individual computer science contest for young people under 20. The success of this experiment confirmed the interest of a contest like this one, which became a model for the next editions : the online selection, the regional events and the final. The latter, atypical with its 36-hour nonstop contest, is the main specificity of the contest.
fr: La première édition de Prologin eut lieu en 1992, sous la forme d'un concours national individuel d'informatique, destiné aux jeunes de moins de 20 ans. Le succès de cette expérience confirma l'intérêt d'un concours de ce type, qui servit de modèle de base pour les éditions suivantes : une première sélection par questionnaire, des épreuves dans différentes villes et la finale. Cette dernière, se voulant atypique avec son épreuve de programmation de 36h non-stop, a fait l'identité du concours.

source: The winners of Prologin
fr: Les vainqueurs de Prologin

source: From its creation, Prologin rewards the contestants that show excellence in a scientific field, despite its absence in most curriculums. This is the list of these students by year.
fr: Depuis sa création, Prologin récompense les candidats qui se distinguent par leur excellence dans une discipline scientifique malgré le fait qu'elle soit absente de la plupart des programmes scolaires. Voici donc la liste de ces étudiants année par année.

source: No edition this year
fr: Pas d'édition cette année

source: No data available
fr: Données indisponibles

source: The organization
fr: L'association

source: About the Prologin organization
fr: À propos de l'association Prologin

source: Prologin is a nonprofit organization whose main mission is to develop and organize the <a href="%(contest_url)s">Prologin computing contest</a>.
fr: Prologin est une association de bénévoles dont la mission principale est d'organiser le <a href="%(contest_url)s">concours d'informatique Prologin</a>.

source: Jump to description
fr: Aller à la description

source: Contact info
fr: Informations de contact

source: The %(year)s team
fr: L'équipe %(year)s

source: See the %(count)s volunteers
fr: Voir les %(count)s bénévoles

source: Legal status
fr: Statut légal

source: Prologin is a French “law 1901” organization registered under the sub-prefecture of <em>L'Hay-les-Roses</em> on 2000-08-04.
fr: Prologin est une association loi de 1901, déclarée à la sous-préfecture de <em>L'Hay-les-Roses</em> le 04-08-2000.

source: CNIL registration number:
fr: Numéro de déclaration CNIL :

source: In accordance with Article 34 of the “Informatique et Liberté” law, you have the right to access, modify and delete data concerning you. To exercise this right, please contact Prologin using one of the methods listed in the “Contact info” box.
fr: Conformément à l'article 34 de la loi « Informatique et Liberté », vous disposez d'un droit d'accès, de rectification et suppression des données à caractère personnel vous concernant. Pour exercer ce droit, veuillez contacter Prologin en utilisant l'une des méthodes listées dans l'encart « Informations de contact. »

source: A computer enthusiasts organization
fr: Une association de passionnés d'informatique

source: <p class="text-justify">The purpose of Prologin is to enable young computer enthusiasts to meet and compete with one another. Indeed, computer science is still largely under represented in French schools. Therefore, those who practice it are often self-taught and have an individual practice of it. However, any large project requires teamwork. This is why, even though candidates seat the exam individually, the competition should facilitate the exchange of ideas between candidates. To promote these exchanges, the Prologin team tries to design the contest topics so they put forward playful aspects. Meanwhile, everything is done so that participants can and should exchange ideas within a cheerful atmosphere. Combining work and pleasure is therefore a key objective of Prologin.</p> <p class="text-justify">We want to allow the candidates to take advantage of the competition to enhance their skills. We try to cover as many areas of computer science: artificial intelligence algorithms, general culture, various programming languages…</p> <p class="text-justify">For the organizers, the competition is an opportunity to manage a team and to organize a event. We must also learn how to communicate effectively in order to make it known to a wider public. Managing relations with sponsors, creating statements and solving both technological and logistic issues are also an enriching experiences for our staff members.</p> <p class="text-justify">Finally, for all the survivors who reach the final, it is also the opportunity to spend a super crazy weekend with us!</p>
fr: <p class="text-justify">Le but de Prologin est de permettre à de jeunes passionnés d'informatique de se rencontrer et de se mesurer les uns aux autres. En effet, l'apprentissage de l'informatique est sous representé dans les écoles françaises. Par conséquent, ceux qui la pratiquent sont souvent autodidactes et en ont une expérience individuelle. Cependant, n'importe quel projet important demande du travail d'équipe. C'est pourquoi, quand bien même les candidats participent individuellement, la compétition devrait faciliter l'échange des idées entre les candidats. Pour faciliter ces échanges, l'équipe de Prologin choisit comme sujet de concours des jeux. En même temps, tout est mis en œuvre pour que les participants puissent échanger des idées dans une atmosphère détendue. Mêler travail et plaisir est donc un des objectifs clefs de Prologin.</p> <p class="text-justify">Nous voulons permettre aux candidats de profiter de la compétition pour s'améliorer. Nous essayons de couvrir le plus possible de facettes de l'informatique : algorithmes d'intelligence artificielle, culture générale, plusieurs langages de programmation...</p> <p class="text-justify">Pour les organisateurs, le concours est l'opportunité de gérer une équipe et organiser un événement. Nous devons également apprendre comment communiquer efficacement pour toucher un plus grand public. Gérer les relations avec les sponsors et résoudre des problèmes aussi bien techniques que logistiques sont également une expérience enrichissante pour les membres de l'équipe.</p> <p class="text-justify">Finalement, pour tous les survivants qui atteignent la finale, c'est aussi l'occasion de passer un super weekend avec nous&nbsp;!</p>

source: Everyone can contribute to Prologin
fr: Tout le monde peut contribuer à Prologin
