Repository: prologin/concours-site
Catalog: prologin/locale/*/LC_MESSAGES/django.po
Languages: fr

source: It's the name of the organization that organize the Girls Can Code! camps but i's also a computer science contest for people under 21 years old. On the website, you can find archives of the previous years exercises. They are small exercises that give a entry and expect a precise answer, and it's your task to code the program giving the expected answer !
fr: C’est le nom de l’association qui organise les stages mais aussi un concours d’informatique destiné aux jeunes de moins de 21 ans. Sur son site, tu peux trouver les archives des exercices des années précédentes. Ce sont des petits problèmes qui donnent une entrée et demandent une réponse précise, c’est à toi d’écrire le programme qui trouve la réponse !

source: Heads up! You are editing another user's information, as a staff member. Take extra care.
fr: Attention ! Vous modifiez les informations d'un autre membre, en votre qualité de membre d'équipe. Restez concentré.

source: Delete %(username)s account
fr: Supprimer le compte de %(username)s

source: Are you sure you want to delete your account?
fr: Voulez-vous vraiment supprimer votre compte ?

source: This will delete all your personal information, including:
fr: Cela aura pour effet de supprimer toutes vos données personnelles, notamment&nbsp;:

source: the codes you submitted during training and contest
fr: les codes que vous avez soumis en entraînement et pendant les épreuves

source: your forum messages
fr: vos messages sur les forums

source: your participation history in the contest
fr: votre historique de participation au concours

source: This action <strong>cannot be reverted</strong>, in compliance with GDPR article 17. You will be logged out immediately after clicking the button below. To proceed, provide your username and password and confirm.
fr: Cette action <strong>ne peut pas être annulée</strong>, conformément l'article 17 du RGPD. Vous serez immédiatement déconnecté⋅e après avoir cliqué sur le bouton ci-dessous. Pour continuer, fournissez votre nom d'utilisateur, votre mot de passe et confirmez.

source: Delete and log out
fr: Supprimer et déconnecter

source: Editing %(username)s's profile
fr: Modification du profil de %(username)s

source: Change password
fr: Modifier le mot de passe

source: Don't forget to click “Save” at the bottom when you are done making changes.
fr: N'oubliez pas de cliquer sur « Enregistrer » en bas lorsque vous avez terminé vos modifications.

source: Save
fr: Enregistrer

source: Editing %(username)s's password
fr: Modification du mot de passe de %(username)s

source: Save
fr: Enregistrer

source: GCC! − Sign in
fr: GCC! - Connexion

source: Sign in to your
fr: Connectez vous à votre

source: account
fr: compte

source: GCC! - Profile
fr: GCC! - Profil

source: <em>not provided</em>
fr: <em>non renseigné</em>

source: Edit profile
fr: Modifier le profil

source: %(username)s's staff picture
fr: Photo de profil d'équipe de %(username)s

source: Phone number
fr: Téléphone

source: Birth day
fr: Date de naissance

source: Postal address
fr: Adresse postale

source: Date joined
fr: Date d'inscription

source: Contest involvment
fr: Participation au concours

source: See archives
fr: Voir les archives

source: Completed the qualification step
fr: A complété l'étape de qualification

source: Selected for regional events
fr: Sélectionné pour les épreuves régionales

source: Abandoned the regional events
fr: S'est désisté avant l'épreuve régionale

source: Competed in the regional events
fr: A participé aux épreuves régionales

source: Selected for the final
fr: Sélectionné en finale

source: Download final home (tar.gz, %(size)s)
fr: Télécharger la “home” (tar.gz, %(size)s)

source: Sadly, %(username)s did not take part in any Prologin edition yet.
fr: Hélas, %(username)s n'a jusqu'ici participé à aucune édition de Prologin.

source: Latest authored news entries
fr: Dernières actualités publiées

source: Staff roles
fr: Rôles dans l'équipe

source: Account management
fr: Gestion du compte

source: Export your personal data
fr: Exporter vos données personnelles

source: You can download an archive containing all your personal data, as provided by your Right to data portability (Art. 20 of GDPR).
fr: Vous pouvez télécharger une archive contenant toutes vos données personnelles, comme prévu par le Droit à la portabilité (Art. 20 du RGPD).

source: Delete your account
fr: Supprimer votre compte

source: You can delete your account and all associated personal data, as provided by your Right to erasure (Art. 17 of GDPR).
fr: Vous pouvez supprimer votre compte et toutes les données personnelles associées, comme prévu par votre Droit à la suppression (Art. 17 du RGPD).

source: You cannot delete your account while participating to the contest. If needed, contact the staff.
fr: Vous ne pouvez pas supprimer votre compte alors que vous participez au concours. Si besoin, contactez l'équipe.

source: GCC! − Register
fr: GCC! - Inscription

source: Register to
fr: S'inscrire à

source: Subscription succeeded
fr: Inscription réussie

source: Subscription failed: already subscribed
fr: L'inscription a échoué: vous êtes déjà inscrit

source: Successfully unsubscribed from newsletter.
fr: Désinscription de la newsletter réussie.

source: Failed to unsubscribe: wrong token.
fr: La désinscription a échoué: mauvais token.

source: Failed to unsubscribe: unregistered address
fr: La désinscription a échoué: adresse non enregistrée.

source: Failed to validate your application, your profile is incomplete.
fr: Impossible de valider votre inscription, votre profil est incomplet.

source: Successfully validated your application.
fr: Inscription validée avec succès.

source: Your application has already been validated, if you really want to change something contact us by email.
fr: Votre inscription est déjà validée, veuillez nous contacter par mail si vous devez changer quelque-chose.

source: Prologin, the French National Computer Science Contest
fr: Prologin, le concours national d'informatique

source: Prologin is a computer science contest. Our goal is to introduce students to the world of programming and algorithms by subjecting them to several conventional problems and exciting challenges.
fr: Prologin est un concours d'informatique. Notre but est de faire découvrir le monde de la programmation et de l'algorithmique aux étudiants et de les confronter à des problèmes classiques et des challenges excitants.

source: Latest news
fr: Dernières actualités

source: Browse all news
fr: Consulter toutes les actualités

source: Written by
fr: Rédigé par

source: Show all %(author)s's entries
fr: Tous les articles de %(author)s

source: on
fr: le

source: Written on
fr: Rédigé le

source: You have one weekend to develop an artificial intelligence for a custom-made game, in Paris.
fr: Développement d'une intelligence artificielle pour un jeu multi-joueur pendant un week-end, à Paris.

source: Train now
fr: S'entraîner

source: The final will take place at:
fr: La finale aura lieu à&nbsp;:

source: Download paperwork
fr: Télécharger les documents

source: The final is now finished!
fr: La finale est maintenant terminée&nbsp;!

source: Statement, results & scoreboard
fr: Sujet, résultats & classement

source: The final is now finished! Stay tuned for the results.
fr: La finale est maintenant terminée&nbsp;! Restez à l'écoute pour connaître les résultats.

source: Consists of a written exam and some problems to solve on the computer. Exam centers are distributed accross France large cities.
fr: Une épreuve écrite et des exercices sur machine. Les centres d'examen sont répartis dans les grandes villes de France.

source: Born in %(born_year)s or after? Join the Prologin contest! Registration is free.
fr: Vous êtes né en %(born_year)s ou après&nbsp;? Participez à Prologin&nbsp;! L'inscription est gratuite.

source: Unknown date
fr: Date inconnue

source: Full leaderboard
fr: Classement complet

source: Sponsors
fr: Partenaires

source: Quiz completed
fr: Questionnaire soumis

source: Complete the quiz
fr: Compléter le questionnaire

source: %(problems_completed)s/%(problems_count)s problems tackled
fr: %(problems_completed)s/%(problems_count)s problèmes abordés

source: Review the extra details
fr: Vérifier les informations supplémentaires

source: Register now!
fr: S'inscrire !

source: Congratulations! You have been selected for the regional events.
fr: Félicitations&nbsp;! Le jury a accepté votre participation pour les épreuves régionales.

source: Please proceed to download your invitation papers and start training for the next step!
fr: Téléchargez dès maintenant les documents de convocation et commencez à vous entraîner pour l'étape suivant&nbsp;!

source: Sorry, this year your application was not selected for the regional events.
fr: Navré, cette année votre participation n'a pas été retenue pour les épreuves régionales.

source: Do not lose hope though! Start training right away so you can perfect your knowledge of algorithms and programming, and try again next year. Best luck!
fr: Ne perdez pas espoir&nbsp;! Continuez de vous entraîner pour parfaire votre connaissance de l'algorithmique et de la programmation, et recommencez l'an prochain. Bonne chance&nbsp;!

source: There is a problem with your application. Please contact the staff as soon as possible.
fr: Il y a un problème avec votre participation. Merci de contacter l'équipe dès que possible.

source: You did not apply for the contest this year.
fr: Vous n'avez pas participé au concours cette année.

source: Come back for the next edition!
fr: Tentez votre chance l'an prochain&nbsp;!

source: Log in to check if you were selected for the regional events.
fr: Connectez-vous pour savoir si votre participation a été acceptée.

source: Login
fr: Connexion

source: A quiz and %(problems_count)s problems to solve online.
fr: Un questionnaire et %(problems_count)s exercices à résoudre en ligne.

source: %(problems_count)s problems to solve online.
fr: %(problems_count)s problèmes à résoudre en ligne.

source: The jury's decision will soon be announced by email and on the website.
fr: La décision du jury sera bientôt annoncée par e-mail et sur ce site.

source: You can start ahead by training for the regional events.
fr: Vous pouvez dès à présent commencer à vous entraîner pour les épreuves régionales.

source: Prologin %(year)s is now finished!
fr: Prologin %(year)s est maintenant terminé&nbsp;!

source: Stay tuned for next year's edition. We will announce when it starts on this website and by email.
fr: Restez à l'affût de la prochaine édition. Nous annoncerons le lancement sur ce site et par e-mail.

source: Start training!
fr: Entraînez-vous&nbsp;!

source: Qualifications will open %(date)s.
fr: Les qualifications ouvrent le %(date)s.

source: Qualifications for this year's edition will be announced as soon as possible.
fr: Les qualifications pour cette année seront annoncées dès que possible.

source: Your regional event will take place at:
fr: Votre épreuve régionale se déroulera à&nbsp;:

source: The jury did not assign your regional event location. Please contact the staff as soon as possible.
fr: Le jury n'a pas assigné votre centre d'épreuve régionale. Merci de contacter l'équipe dès que possible.

source: You can start ahead by training for the final.
fr: Vous pouvez dès à présent commencer à vous entraîner pour la finale.

source: Congratulations! You have been selected for the final.
fr: Félicitations&nbsp;! Le jury a accepté votre participation pour la finale.

source: Please proceed to download your invitation papers and start reviewing previous edition finals.
fr: Téléchargez dès maintenant les documents de convocation et commencez à consulter les archives des précédentes finales.

source: Sorry, this year your application was not selected for the final.
fr: Navré, cette année votre participation n'a pas été retenue pour la finale.

source: See all the dates
fr: Voir toutes les dates

source: Email count
fr: Nombre de mails

source: HTML enabled
fr: HTML activé

source: Generate HTML from plaintext
fr: Générer le HTML depuis le texte brut

source: Useful queries
fr: Requêtes utiles

source: You must provide an HTML template if HTML is enabled.
fr: Vous devez fournir un gabarit HTML si vous activez le HTML.

source: i am fine bothering %(n)s people
fr: ok pour ennuyer %(n)s personnes

source: Foolproofing
fr: Anti-stupidité

source: Type “%s” above
fr: Recopiez “%s” ci-dessus

source: Send
fr: Envoyer

source: Actually send to %(n)s people right now
fr: Vraiment envoyer à %(n)s personnes, immédiatement

source: Subject template
fr: Gabarit du sujet

source: Plaintext body template
fr: Gabarit en texte brut

source: HTML body template
fr: Gabarit en HTML

source: Template
fr: Gabarit

source: Templates
fr: Gabarits

source: Query
fr: Requête

source: Useful with templates
fr: Utile avec les gabarits

source: Queries
fr: Requêtes

source: The root model is not %(model)s. You must provide a `user` alias.
fr: Le modèle racine n'est pas %(model)s. Vous devez fournir un alias `user`.

source: %(label)s.%(field)s is not %(model)s
fr: %(label)s.%(field)s n'est pas %(model)s

source: %(label)s has no field `%(field)s`
fr: %(label)s n'a pas de champ `%(field)s`

source: Optional name
fr: Nom (optionnel)

source: Batch
fr: Lot

source: Batches
fr: Lots

source: Batch %(id)s
fr: Lot %(id)s

source: Send a new batch
fr: Envoyer un nouveau lot

source: New batch
fr: Nouveau lot

source: Batch details for %(name)s
fr: Détail du lot %(name)s

source: Initiated by <strong>%(initiator)s</strong> on %(date)s.
fr: Initié par <strong>%(initiator)s</strong> le %(date)s.

source: Subject
fr: Sujet

source: State
fr: État

source: Initiator
fr: Initiateur

source: Created
fr: Créé le

source: Progress
fr: Progressio

source: Completed
fr: Terminé

source: Retry pending
fr: Réessayer ceux en attente

source: Total ⋅ Pending ⋅ Sending ⋅ Sent ⋅ Bounced ⋅ Complaints
fr: Total ⋅ En attente ⋅ En envoi ⋅ Envoyés ⋅ “Bounces” ⋅ Plaintes

source: There is no batch yet.
fr: Il n'y a pas encore de lot.

source: Delete a batch
fr: Supprimer un lot

source: Are you sure you want to delete <em>%(batch)s</em>?
fr: Voulez-vous vraiment supprimer <em>%(batch)s</em> ?

source: Cancel
fr: Annuler

source: Dashboard
fr: Tableau de bord

source: Mailing dashboard
fr: Tableau de bord mailing

source: All batches
fr: Tous les lots

source: Craft a new template
fr: Créer un nouveau gabarit

source: Related useful queries
fr: Requêtes utiles liées

source: Plaintext + HTML
fr: Brut + HTML

source: There is no template yet.
fr: Il n'y a pas encore de gabarit.

source: Craft a new query
fr: Créer une nouvelle requête

source: Templates this query is useful for
fr: Gabarits utiles pour cette requête

source: There is no query yet.
fr: Il n'y a pas encore de requête.

source: New query
fr: Nouvelle requête

source: Update query %(name)s
fr: Modifier la requête %(name)s

source: Details
fr: Détails

source: Save query
fr: Enregistrer la requête

source: Preview
fr: Prévisualiser

source: <code class="result-model"></code> count
fr: Nombre de <code class="result-model"></code>

source: Unique user count
fr: Nombre d'utilisateurs uniques

source: <code class="result-model"></code> accessible by
fr: <code class="result-model"></code> accessible via

source: Available aliases
fr: Alias accessibles

source: Generated SQL query
fr: Requête SQL générée

source: Syntax guide & shortcuts
fr: Guide de syntaxe et raccourcis

source: Filters are implicity joined by the <code>and</code> operator. If you are not querying on the <code>ProloginUser</code> model directly, you must create a <code>user</code> alias targeting a field containing the related user.
fr: Les filtres sont implicitement joints par l'opérateur <code>and</code>. Si vous ne requêtez pas directement le modèle <code>ProloginUser</code>, vous devez définir un alias <code>user</code> qui cible le champ contenant l'utilisateur lié.

source: Available models
fr: Modèles disponibles

source: Available enumerations
fr: Énumérations disponibles

source: Available functions
fr: Fonctions disponibles

source: New template
fr: Nouveau gabarit

source: Update template %(name)s
fr: Modifier le gabarit %(name)s

source: Preview with query
fr: Prévisualiser avec la requête

source: Save template
fr: Enregistrer le gabarit

source: Plaintext
fr: Texte brut

source: The form was modified and saved while you were editing. Please merge with current version.
fr: Le formulaire a été enregistré pendant vous le modifiez. Veuillez fusionner vos modifications avec la version actuelle.

source: Syntax error at position %(pos)s.
fr: Erreur de syntaxe à la position %(pos)s.

# Written by <user> *on* <date>
source: on
fr: le

# *Written on* <date>
source: Written on
fr: Rédigé le

source: Last update on
fr: Dernière mise à jour le

source: %(percent)s%% of %(object)s still remains to read.
fr: Il reste %(percent)s%% de %(object)s à lire.

source: Continue reading
fr: Continuer la lecture

source: Show all entries tagged by %(tag)s
fr: Afficher tous les articles taggés avec %(tag)s

source: No tags
fr: Pas de tag

source: Persistent URL:
fr: URL permanente :

source: Short URL to %(object)s
fr: URL courte vers %(object)s

source: RSS feed of last entries
fr: Flux RSS des dernières actualités

source: RSS feed of last discussions
fr: Flux RSS des dernières discussions

source: Latest entries
fr: Derniers articles

source: Yearly archives
fr: Archives annuelles

source: Previous day
fr: Jour précédent

source: Next day
fr: Jour suivant

source: Week %(week_number)s of %(year)s
fr: Semaine %(week_number)s de %(year)s

source: Daily archives
fr: Archives journalières

source: Previous month
fr: Mois précédent

source: Next month
fr: Mois suivant

source: Today archives
fr: Archives pour aujourd'hui

source: Archives week %(week_number)s of %(year)s
fr: Archives de la semaine %(week_number)s de %(year)s

source: Monthly archives
fr: Archives mensuelles

source: Previous year
fr: Année précédente

source: Next year
fr: Année suivante

source: RSS feed of discussions on
fr: Flux RSS des discussions sur

source: RSS feed of comments on
fr: Flux RSS des commentaires sur

source: RSS feed of pingbacks on
fr: Flux RSS des pingbacks sur

source: RSS feed of trackbacks on
fr: Flux RSS des tracebacks sur

source: Next entry
fr: Article suivant

source: Previous entry
fr: Article précédent

source: Related entries
fr: Articles liés

source: Similar entries
fr: Articles similaires

# on date
source: on
fr: sur

source: Direct link to this pingback
fr: Lien direct vers ce pingback

source: Pingbacks are open.
fr: Les pingbacks sont activés.

source: Pingbacks are closed.
fr: Les pingbacks sont désactivés.

source: Direct link to this trackback
fr: Lien direct vers ce traceback

source: Trackback URL
fr: URL du traceback

source: Edit the entry
fr: Modifier cet article

source: The latest entries categorized under %(object)s
fr: Les derniers articles catégorisés dans %(object)s

source: The latest entries tagged with %(object)s
fr: Les derniers articles tagués avec %(object)s

source: The latest entries by %(object)s
fr: Les derniers articles de %(object)s

source: Category %(object)s
fr: Catégorie %(object)s

source: Author %(object)s
fr: Auteur %(object)s

source: RSS feed of %(object)s
fr: Flux RSS sur %(object)s

source: Category archives: %(category)s
fr: Archives de la catégorie : %(category)s

source: Tag archives: %(tag)s
fr: Archives du tag : %(tag)s

source: No entries yet.
fr: Pas encore d'articles.

source: Edit the category
fr: Modifier la catégorie

source: Edit the tag
fr: Modifier le tag

source: Edit the author
fr: Modifier l'auteur

source: Page %(current_page)s of %(total_page)s
fr: Page %(current_page)s de %(total_page)s

source: More recent entries
fr: Plus d'articles récents

source: Entries page
fr: Page

source: Older entries
fr: Articles antérieurs

source: News
fr: Actualités

source: Contest rules
fr: Règlement

source: Important notice
fr: Remarque importante

source: The contest rules are only available in French, as the contest is only open to French speakers ("article 3").
fr: Les règles du concours ne sont disponibles qu'en français, étant donné que le concours n'est ouvert qu'aux francophones (cf. « article 3 »).

source: About the contest
fr: À propos du concours

source: Discover the Prologin contest
fr: Découvrir le concours Prologin

source: About the Prologin contest
fr: À propos du concours Prologin

source: Prologin is a computer science contest open to all students under %(max_age)s, organized by the <a href="%(assoc_url)s">Prologin organization</a>. Our goal is to introduce young students to the world of programming and algorithms, by subjecting them to several conventional problems and exciting challenges. The contest takes places in three stages of successive selection presented in the following sections. Prologin is a nonprofit organization, it is free to enter the contest.
fr: Prologin est un concours d'informatique ouvert à tous les étudiants agés de moins de %(max_age)s, organisé par <a href="%(assoc_url)s">l'association Prologin</a>. Notre but est de faire découvrir le monde de la programmation et de l'algorithmique aux étudiants et de les confronter à des problèmes classiques et des challenges excitants. Le concours se déroule en trois étapes de sélections consécutives présentées dans les sections suivantes. Prologin est une association à but non lucratif, et son concours est totalement gratuit.

source: To learn more about the history of the contest, you can visit the <a href="%(history_url)s">history page</a>.
fr: Pour en apprendre plus sur l'histoire du concours, vous pouvez visiter la <a href="%(history_url)s">page d'historique</a>.

source: For an accurate time-line of this year events, please see the <a href="%(home_url)s">home page</a>.
fr: Pour un planning détaillé des événements de cette année, consultez la <a href="%(home_url)s">page d'accueil</a>.

source: 1<sup>st</sup> step – Qualification
fr: 1<sup>e</sup> étape – Sélection

source: The screening questionnaire allows to qualify for regional competitions. It consists of a selection of algorithmic problems of increasing difficulty. It is possible to submit the questionnaire by postal mail or directly on this website.
fr: Le questionnaire de sélection vous permet de vous qualifier pour les épreuves régionales. Il s'agit de résoudre une sélection de problèmes d'algorithmique de difficulté croissante. Le questionnaire doit être soumis directement sur ce site.

source: Registration is entirely free, you only need an Internet access to submit your answers.
fr: Les inscriptions sont totalement gratuites, vous avez uniquement besoin d'un accès à Internet pour envoyer vos réponses.

source: Who can qualify?
fr: Qui peut participer&nbsp;?

source: Any student born in or after %(born_year)s, living in Europe, who can understand and write French.
fr: Tous les étudiant(e)s francophones nés en %(born_year)s ou après, habitant en Europe.

source: Students from EPITA are not allowed to participate.
fr: Les étudiant(e)s de EPITA ne peuvent pas participer.

source: Learn more
fr: En savoir plus

source: 2<sup>nd</sup> step – Regional events
fr: 2<sup>e</sup> étape – Les épreuves régionales
