Repository: prologin/concours-site
Catalog: prologin/locale/*/LC_MESSAGES/django.po
Languages: fr

source: <p class="text-justify">Contributing can be done in various ways: promoting the event, developing the website and the software architecture for the final, helping during the regional events, contributing in the forums, and so on. We also appreciate your feedback and your suggestions.</p> <p class="text-justify">We also need your help with the training section, where users can try themselves on a large set of statements. If you can give us a hand, please do: we are looking for new statements (originals or translations of third parties), courses, and corrections. Of course, please contact us before contributing so we can prevent certain parts being done in duplicate.</p>
fr: <p class="text-justify">Il existe divers moyens de contribuer&nbsp;: promouvoir l'événement, développer le site internet et l'architecture logicielle pour la finale, aider lors des épreuves régionales, participer dans les forums, etc. Nous apprécions aussi les retours et suggestions.</p> <p class="text-justify">Nous avons aussi besoin de votre aide pour la section d'entraînement, dans laquelle les utilisateurs peuvent se mesurer à un grand nombre de problèmes. Si vous pouvez nous donner un coup de main, n'hésitez pas&nbsp;: nous sommes à la recherche de nouveaux problèmes (originaux ou traduits depuis d'autres sources), cours et corrections. Bien sûr, veuillez nous contacter avant de contribuer afin que nous puissions éviter que certaines choses soient faites en double.</p>

source: The qualification stage
fr: L'étape de sélection

source: This test typically takes the form of four or five small algorithmic problems of increasing difficulty. This is both to publicize the contest and select candidates with the minimum level required to participate in the next stages. This is also an opportunity to encourage young people, including those who will not participate in the events which will follow, to tackle the various areas about computing that they may not had the opportunity to address so far.
fr: Cette épreuve prend généralement la forme de quatre ou cinq petits problèmes d'algorithmique de difficulté croissante. Il s'agit à la fois de faire connaître le concours à un maximum de monde, et de sélectionner les candidats ayant le niveau minimum requis pour participer à la suite du concours. C'est également l'occasion d'inciter les jeunes, y compris ceux qui ne participeront pas à la suite des épreuves, à s'interroger sur les différents domaines touchant l'informatique qu'ils n'avaient peut-être pas eu l'occasion d'aborder jusque là.

source: Posters are sent to various schools all over France (high schools, IUT, colleges, etc.). There are sent to former candidates as well, who represent the most effective way to publicize the competition.
fr: Des posters sont envoyés dans de nombreux établissements scolaires partout en France (lycées, IUT, universités...), ainsi qu'aux anciens candidats, qui sont le moyen le plus efficace de faire connaître le concours.

source: Some years, the questionnaire is also published in various targeted computer magazines. For example, for the 2004 edition, 120'000 copies of the quiz were distributed on paper.
fr: Certaines années, le questionnaire est également publié dans différents magazines informatiques ciblés. Par exemple pour l'édition 2004, ce sont 120000 exemplaires du QCM qui ont été distribués en version papier.

source: Why are students from EPITA not allowed to compete?
fr: Pourquoi les étudiant(e)s de EPITA n'ont pas le droit de concourir&nbsp;?

source: Prologin is registered as an association that is part of the EPITA engineering school. As such, members of the school are not allowed to compete in the Prologin contest.
fr: Prologin est une association qui fait partie de l'école d'ingénieur EPITA. Ainsi, les membres de cette école n'ont pas le droit de participer au concours Prologin.

source: The regional events
fr: Les épreuves régionales

source: The regional event tests are intended to test the capability of candidates to solve algorithmic problems but also to implement theirs solution on a machine, in the programming language they prefer. This is also an opportunity for candidates to meet other enthusiasts, and for the organizers to relate their experience, to help them progress.
fr: Les épreuves régionales sont destinées à tester les capacités des candidats d'une part à résoudre des problèmes de manière algorithmique, et d'autre part à mettre en œuvre cette démarche sur une machine, dans le langage de leur choix. Ce doit aussi être l'occasion pour les candidats de rencontrer d'autres passionnés, et pour les organisateurs de leur faire part de leur expérience, pour les aider à progresser.

source: The 200 to 300 selected candidates are divided into different regional events, which take place in multiple sessions from mid-January, in the following French cities: Paris, Lyon, Toulouse, Strasbourg, Nantes, Lille, Toulon, Louvain-la-Neuve and Bordeaux.
fr: Les 200 à 300 candidats sélectionnés sont répartis dans les différentes épreuves régionales se déroulant en plusieurs sessions à partir de mi-janvier dans les villes françaises suivantes : Paris, Lyon, Toulouse, Strasbourg, Nantes, Lille, Toulon et Bordeaux. Une épreuve est aussi organisée en Belgique à Louvain-la-Neuve.

source: The three tests
fr: Les trois épreuves

source: The written exam
fr: L'examen écrit

source: The written exam lasts three hours. The test consists of a series of five or six questions around a common theme. These questions of increasing difficulty guide the contestant in the stages of resolution of an algorithmic problem. The first exercices focus on modeling the problem and are here to check that the candidate masters the basic principles of algorithms, and the next exercises require the contestant to code effective algorithms for harder problems.
fr: L'épreuve d'algorithmique sur papier, d'une durée de trois heures, est composée d'une série de cinq ou six questions autour d'un thème commun. Ces questions, de difficulté croissante, guident le candidat dans les étapes de résolution d'un problème d'algorithmique. Les premières portent sur la modélisation du problème et permettent de vérifier que le candidat maîtrise les principes de base de l'algorithmique, et les dernières consistent à rechercher et évaluer des algorithmes efficaces, pour des problèmes plus difficiles.

source: The interview
fr: L'entretien

source: The interview lasts between ten and twenty minutes. It is a way for us to meet individually every contestant, test their knowledge, learn about the personal projects he works on, while giving him advices to improve.
fr: L'entretien d'une vingtaine de minutes nous permet de faire la connaissance de chaque candidat individuellement, de tester ses connaissances, et de l'écouter présenter les projets informatiques personnels qu'il a pu réaliser, tout en le conseillant éventuellement sur les moyens de progresser.

source: The practical test
fr: L'épreuve sur machine

source: The practical test lasts four hours. Every contestant works on algorithmic exercises on a computer. A judging program evaluates the code submissions of the contestant. The goal of this test is to check that the contestant is able to code a program on a computer (choose an algorithm, implement it in a programming language, test it and debug it).
fr: L'épreuve pratique, d'une durée de quatre heures, consiste en une série d'exercices de programmation de difficulté croissante. Une machine est mise à disposition de chaque candidat, et un programme de test lui fournit les sujets, et vérifie le fonctionnement des programmes qu'il soumet. Cette épreuve a pour but de vérifier que le candidat est capable de mettre en œuvre ce qu'il sait pour réaliser un programme sur un ordinateur (choix de l'algorithme, implémentation dans le langage choisi, tests et déboguage).

source: All these tests are individual. No other documents than those given by Prologin are authorized.
fr: Toutes ces épreuves sont individuelles : aucun document autre que ceux fournis par Prologin ne sont autorisés.

source: The typical course of a regional event day
fr: Le déroulement typique d'une journée d'épreuve régionale

source: Welcoming contestants, free breakfast
fr: Accueil des candidats, petit déjeuner offert

source: <tspan x="170">Written exam</tspan> <tspan x="170" dy="20">(3 hours)</tspan>
fr: <tspan x="170">Épreuve écrite</tspan> <tspan x="170" dy="20">(3 hours)</tspan>

source: <tspan x="375">Interview</tspan> <tspan x="375" dy="20">(15-20 minutes)</tspan>
fr: <tspan x="375">Entretiens</tspan> <tspan x="375" dy="20">(15-20 minutes)</tspan>

source: Free lunch
fr: Repas offert

source: Algorithmic exercises on computer (4h)
fr: Épreuve machine (4h)

source: The contestants are welcomed at 8h30 AM, and meet together while having a free breakfast provided by Prologin. The written exam takes place between 9 AM and 12 AM, during which they also have an interview with a Prologin organizer.
fr: Les candidats sont accueillis vers 8h30 le matin, et font connaissance en prenant le petit déjeuner, offert par Prologin. L'épreuve d'algorithmique se déroule de 9h à 12h, et en parallèle les candidats passent chacun à leur tour un entretien avec un organisateur.

source: Before or during the lunch, also provided by Prologin, the organizers present a quick correction of some of the problems the candidates have just worked on.
fr: Avant ou pendant le repas du midi, également offert par Prologin, les organisateurs présentent une rapide correction des problèmes les plus difficiles de l'épreuve écrite.

source: The day continues with the practical test, which lasts four hours, and ends at 5:30 PM.
fr: La journée se poursuit avec l'épreuve machine, d'une durée de quatre heures, et se termine vers 17h30.

source: The exam submissions are marked according to the validity and the efficiency of the proposed algorithms. The syntax of the languages used and other similar aspects are not taken in account, as they are already needed for the coding exercises.
fr: Les copies de l'épreuve papier sont notées en fonction de la validité et de l'efficacité des algorithmes proposés. La maîtrise de la syntaxe du langage et autres aspects similaires ne sont pas pris en compte : ils sont sanctionnés par l'épreuve machine.

source: After the interview, a grade is also given according to various criteria.
fr: À l'issue de l'entretien, une note est également attribuée en fonction de différents critères d'évaluation.

source: The grade of the practical test is attributed automatically by the juding system, according to the number of solved exercises, the number of tries to achieve that, and the time spent on each exercise before a correct solution was found.
fr: La note de l'épreuve machine est attribuée automatiquement par le système de test, en fonction du nombre d'exercices résolus, du nombre d'essais effectués pour y parvenir, et du temps passé sur chacun avant qu'une solution correcte ne soit obtenue.

source: The final ranking, after which a hundred contestants are selected, is obtained from these three grades.
fr: Le classement final, à l'issue duquel 110 candidats sont sélectionnés, est effectué à partir de ces trois notes.

source: The regional events are spread over several weekends, during which between one to three regional events take place in different locations.
fr: Les épreuves régionales sont réparties en plusieurs week-ends, pendant lesquels se déroulent simultanément une à trois demi-finales, dans des lieux différents.

source: A team of at least three Prologin members is dedicated to the logistics of each event, to prepare the equipment, welcome the contestants, monitor the tests, take care of the food and assist the contestants during the practical test.
fr: Une équipe d'au moins trois membres de Prologin est dédiée à l'organisation de chaque événement, pour préparer le matériel, accueillir les candidats, surveiller les épreuves, faire passer les entretiens, fournir les repas, et assister les candidats pendant l'épreuve machine.

source: All the exam centers where the regional events take place provide us with the computer equipment and the classrooms needed, and we are very grateful to them for their help.
fr: Chacun des établissements où se déroulent les épreuves régionales met à notre disposition les salles de cours et le matériel informatique nécessaires à leur organisation, ce dont nous leur sommes très reconnaissants.

source: Yes
fr: Oui

source: No
fr: Non

source: succeeded
fr: résolu

source: corrected
fr: corrigé

source: results expired
fr: résultats expirés

source: Challenge
fr: Épreuve

source: Problem
fr: Problème

source: Username
fr: Nom d'utilisateur

source: Status
fr: Statut

source: Correctable
fr: Corrigeable

source: Submit to correction
fr: Envoyer en correction

source: Submission %(id)s
fr: Soumission %(id)s

source: Solved
fr: Résolu

source: Problem name (optional)
fr: Nom du problème (facultatif)

source: Any event type
fr: Peu importe

source: Minimum difficulty
fr: Difficulté minimale

source: Maximum difficulty
fr: Difficulté maximale

source: All problems
fr: Tous les problèmes

source: Problems I solved
fr: Problèmes que j'ai résolus

source: Problems I did not solve
fr: Problèmes que je n'ai pas résolus

source: You can provide either a source file or a source code, but not both.
fr: Vous devez fournir soit un code source soit un fichier source, mais pas les deux.

source: Your client did not provide the content length of your source file.
fr: Votre client web n'a pas fourni la taille de votre fichier source.

source: The source file you uploaded is too large. Please keep it below %(size)s.
fr: Le fichier source que vous avez envoyé est trop lourd. Veuillez rester en-dessous de %(size)s.

source: Please use the UTF-8 encoding when uploading a source file.
fr: Merci d'utiliser UTF-8 comme encodage de votre fichier source.

source: Source files cannot contain NUL (0x00) characters.
fr: Les fichiers source ne peuvent pas contenir de caractères NUL (0x00).

source: You need to provide either a source file or a source code.
fr: Vous devez fournir un fichier source ou un code source.

source: Qualifications
fr: Sélections

source: unknown
fr: inconnu

source: Compilation went fine.
fr: La compilation a réussi.

source: Compilation exited with code %(code)s.
fr: Le compilateur a quitté avec le code de retour %(code)s.

source: Compilation timed out.
fr: La compilation a dépassé la limite de temps.

source: Compilation was killed with signal %(signal)s.
fr: La compilation a été tuée par le signal %(signal)s.

source: Compilation crashed with an internal error.
fr: La compilation a crashée à cause d'une erreur interne.

source: your program executed fine, but:
fr: votre programme s'est exécuté correctement, mais :

source: your program exited with code %(code)s.
fr: votre programme a quitté avec le code de retour %(code)s.

source: your program timed out.
fr: votre programme a dépassé la limite de temps.

source: your program has exceeded the memory limit.
fr: votre programme a dépassé la limite de mémoire.

source: your program was killed with signal %(signal)s.
fr: votre programme a été tué par le signal %(signal)s.

source: your program crashed with an internal error.
fr: votre programme a crashé à cause d'une erreur interne.

source: Submission
fr: Soumission

source: Corrected
fr: Corrigé

source: Submission code
fr: Code soumis

source: Submission codes
fr: Codes soumis

source: Explicit problem unlock
fr: Déblocage explicite de problème

source: Explicit problem unlocks
fr: Déblocages explicites de problème

source: Please note that only the first %(row_count)s results are displayed below, regardless of the actual number of contestants.
fr: Notez que seuls les %(row_count)s premiers résultats sont affichés ci-après, quel que soit le nombre effectif de participants.

source: No scores to display
fr: Aucun score à afficher

source: Problems for %(type)s %(year)s
fr: Problèmes de %(type)s %(year)s

source: The problem
fr: Le problème

source: Congrats, you solved all the problems!
fr: Bravo, vous avez résolu tous les problèmes&nbsp;!

source: This page contains all the exercises from previous Prologin editions. You can browse through them, and search by difficulty or years. If you need help to get started with algorithmics, you should read our <a href="https://prologin.org/forum/entrainement-3/ressources-i-debutants-1114/">resources</a>.
fr: Voici les annales d'exercices publiés depuis la création du concours Prologin, vous pouvez chercher par difficulté ou encore par année. Si vous avez besoin d'aide pour vous lancer dans l'algorithmique, jetez un œil à nos <a href="https://prologin.org/forum/entrainement-3/ressources-i-debutants-1114/">ressources</a>.

source: Stuck on a problem? Ask for help on the <a href="%(forum)s">forums</a>!
fr: Coincé sur un problème ? Demandez de l'aide sur le <a href="%(forum)s">forum</a> !

source: Jump to problem index
fr: Aller aux problèmes

source: %(count)s&nbsp;problem
fr: %(count)s&nbsp;problème

source: Challenge is hidden to regular users
fr: Le challenge est caché pour les utilisateurs normaux

source: What is this?
fr: Qu'est-ce que c'est&nbsp;?

source: Want to find out what the Prologin algorithmic exercises are like? In this section, you can browse and tackle all the problems from the previous Prologin events. These are problems from both the Prologin online qualifications and the on-site regional events.
fr: Vous voulez découvrir à quoi ressemblent les exercices d'algorithmique de Prologin ? Dans cette section, vous pouvez parcourir les précédentes éditions du concours Prologin et vous entraîner sur tous les problèmes correspondants. Ces exercices proviennent des qualifications en ligne et des épreuves régionales.

source: How does it work?
fr: Comment ça marche&nbsp;?

source: Read the problem statement carefully and submit your solution. The system will check your submission and instantly tell you whether you got it right or wrong. You can submit as many codes as you need to solve the problem.
fr: Prenez le temps de lire l'énoncé du problème attentivement avant de soumettre votre solution. Le système vérifiera votre solution et vous indiquera immédiatement le résultat. Vous pouvez soumettre autant de solutions que nécessaire à la résolution du problème.

source: If you need any help with the automatic correction system, you can read the <a href="%(manual_url)s" style="white-space: nowrap;"><i class="fa fa-book"></i> online judge manual</a>.
fr: Si vous avez besoin d'aide avec le système de correction automatique, vous pouvez lire le <a href="%(manual_url)s" style="white-space: nowrap;"><i class="fa fa-book"></i>manuel du juge en ligne</a>.

source: Manual
fr: Manuel

source: Online judge manual
fr: Manuel du juge en ligne

source: The online training system is a tool to help you improve your programing skills. It is open to everyone, and obviously free. What follows is a guide to understand its principles and get the most out of it.
fr: Le système d'entraînement automatique est un outil pour vous aider à améliorer votre niveau en programmation. Il est ouvert à tous, et bien entendu gratuit. Lisez bien ce qui suit pour bien en comprendre le principe, et en profiter un maximum.

source: Problems
fr: Problèmes

source: The problems given during the previous editions of the Prologin contest are archived and available on this website. You can train with the problems of the qualification and regional event problems of the previous years. They are ordered by year and difficulty: from beginner to advanced.
fr: Les problèmes proposés durant les diverses éditions du concours Prologin sont archivés et disponibles sur ce site. Vous pouvez ainsi vous entraîner sur les problèmes des questionnaires et épreuves régionales passés. Ils sont classés par année et par difficulté : depuis le niveau débutant, à des difficultés bien plus élevées.

source: Evaluation
fr: Évaluation

source: The exercises are evaluated by our server: your program is compiled then tested automatically. It is executed once per test. The possible errors are:
fr: L'évaluation d'un exercice, dans le cas où un source est demandé, est faite par notre serveur : le programme est compilé puis testé automatiquement. Il est exécuté une fois par test. Les erreurs possibles sont :

source: Your program does not compile;
fr: Votre programme ne compile pas ;

source: Your program exceeded the time limit given in the subject;
fr: Votre programme a dépassé la limite de temps donnée dans le sujet ;

source: Your program exceeded the memory limit given in the subject;
fr: Votre programme a dépassé la limite de mémoire donnée dans le sujet ;

source: Your program gave a wrong result for at least one test;
fr: Votre programme donne un résultat faux pour au moins un des tests ;

source: Your program does not terminate correctly.
fr: Votre programme ne se termine pas correctement.

source: If there is a compilation error, the error output of the compiler is shown.
fr: S'il y a une erreur de compilation, la sortie d'erreur du compilateur est affichée.

source: The output produced by your program has to match exactly with the format given in the subjects. The correction system compares the output with a reference output, character by character.
fr: La sortie produite par votre programme doit correspondre exactement avec le formatage précisé dans chacun des énoncés. Le système de correction compare la sortie de votre programme avec une sortie de référence, caractère par caractère.

source: After the tests have been executed, a summary is shown, indicating which tests succeeded and which tests failed. The output of your program and the output given by the correction system is shown only for the first failed test. The exercise will only be considered solved when all the tests succeed.
fr: Après exécution des tests, un récapitulatif vous est affiché, indiquant les tests réussis et les tests ratés. Pour le premier test raté uniquement, la sortie produite par votre programme est affichée, ainsi que la sortie attendue par le système de correction. L'exercice ne sera validé que lorsque tous les tests seront passés avec succès.

source: The correction can take up to several minutes, so be patient.
fr: La correction peut prendre plusieurs minutes, donc soyez patient.

source: The training system grades your submissions. Every solved exercise gives you a number of points that depends of the level of the problem and the number of failed attempts you tried. You should test your program yourself before submitting it.
fr: Le système d'entraînement note vos soumissions ! En effet, chaque problème résolu rapporte un certain nombre de points, dépendant du nombre de soumissions que vous avez fait avant de le résoudre avec succès. Pensez donc à bien tester votre programme vous-même, avant de le soumettre.

source: Code stubs
fr: Codes à compléter

source: For some languages, we provide code stubs that can "parse" correctly the data given in the standard input of the program. You only need to write the content of a stub function that takes these parsed data in parameter. Note that it is absolutely not mandatory to use these stubs, although they can be really useful most of the time.
fr: Nous fournissons, pour certains langages, des codes sources se chargeant de "découper" correctement les données fournies sur l'entrée standard du programme. Il ne vous reste alors qu'à écrire le corps d'une fonction prenant ces données en paramètre. Notez qu'il n'est absolument pas obligatoire de les utiliser, mais cela peut se révéler utile dans bien des cas.

source: Correction system
fr: Système de correction

source: Time and memory limitations
fr: Limitations de mémoire et de temps
