Repository: prologin/concours-site
Catalog: prologin/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Prologin %(year)s: equipment liability release for the final
fr: Prologin %(year)s : décharge dégâts matériels pour la finale

# Document filename
source: equipment-liability-release-%(year)s-final
fr: decharge-degats-materiels-finale-%(year)s

source: Prologin %(year)s: emergency call list for the final
fr: Prologin %(year)s : numéros d'urgence pour la finale

# Document filename
source: emergency-call-list-%(year)s-final
fr: numeros-urgence-finale-%(year)s

source: Prologin %(year)s: planning for the final
fr: Prologin %(year)s : planning de la finale

# Document filename
source: planning-%(year)s-final
fr: planning-finale-%(year)s

source: Prologin %(year)s: diplomas
fr: Prologin %(year)s : diplômes

# Document filename
source: diplomas-%(year)s-final
fr: diplomes-finale-%(year)s

source: Prologin %(year)s: document compilation for final for %(fullname)s
fr: Prologin %(year)s: compilation de documents pour la finale pour %(fullname)s

# Document filename
source: prologin-%(year)s-final-documents-%(fullname)s
fr: prologin-%(year)s-documents-finale-%(fullname)s

source: Prologin %(year)s: enrollment form
fr: Prologin %(year)s : formulaire de recrutement

# Document filename
source: enrollment-form-%(year)s
fr: formulaire-recrutement-%(year)s

# Document filename
source: badges-%(year)s-final
fr: badges-finale-%(year)s

source: Prologin %(year)s: custom badges
fr: Prologin %(year)s : badges personnalisés

# Document filename
source: custom-badges-%(year)s-final
fr: badges-personnalises-%(year)s-finale

source: Prologin %(year)s: Meal tickets
fr: Prologin %(year)s : tickets repas

# Document filename
source: meal-tickets-%(year)s-final
fr: tickets-repas-%(year)s-finale

source: Close selected threads
fr: Fermer les sujets sélectionnés

source: Open (un-close) selected threads
fr: Ouvrir (ne plus fermer) les sujets sélectionnés

source: Make selected threads sticky
fr: Épingler les sujets sélectionnés

source: Make selected threads non-sticky
fr: Rendre les sujets sélectionnés non épinglés

source: Is open
fr: Est ouvert

source: Author
fr: Auteur

source: Compose your message here. You can use the Markdown syntax.
fr: Écrivez votre message ici. Vous pouvez utiliser la syntaxe Markdown.

source: Optional explanation
fr: Explication optionnelle

source: This explanation will be shown above the message.
fr: Cette explication sera montrée au dessus de votre message.

source: Thread title
fr: Titre du sujet

source: Post is visible
fr: Le post est visible

source: Message content
fr: Contenu du message

source: Choose a short, descriptive title.
fr: Choisissez un titre court et explicite.

source: Name
fr: Nom

source: Number of threads
fr: Nombre de sujets

source: Number of posts
fr: Nombre de posts

source: Sticky
fr: Épinglé

source: Announce
fr: Annonce

source: Closed
fr: Fermé

source: Moved
fr: Déplacé

source: Title
fr: Titre

source: Thread type
fr: Type du sujet

source: Thread status
fr: Statut du suje

source: Last post added on
fr: Dernier post ajouté le

source: Thread
fr: Sujet

source: Threads
fr: Sujet

source: Content
fr: Contenu

source: Edit reason
fr: Raison de l'édition

source: Post
fr: Article

source: Posts
fr: Articles

source: New thread
fr: Nouveau sujet

source: Create a new thread
fr: Créer un nouveau sujet

source: in %(name)s
fr: dans %(name)s

source: Create the new thread
fr: Créer un nouveau sujet

# Preview, the action (button)
source: Preview
fr: Prévisualiser

# Preview, the noun (title)
source: Preview
fr: Prévisualisation

source: Edit
fr: Modifier

source: Edit post
fr: Éditer le post

source: in %(title)s
fr: dans %(title)s

source: This forum is empty.
fr: Ce forum est vide.

source: %(count)s thread
fr: %(count)s sujet

source: Last message by <span class="thread-item-author">%(username)s</span>
fr: Dernier message par <span class="thread-item-author">%(username)s</span>

source: There is no forum.
fr: Il n'y a aucun forum.

source: Delete post
fr: Supprimer le message

source: Delete the post
fr: Supprimer le message

source: Are you sure you want to delete the post in <strong>%(title)s</strong> written by <strong>%(author)s</strong>?
fr: Confirmez-vous la suppression du message issu de <strong>%(title)s</strong> rédigé par <strong>%(author)s</strong>&nbsp;?

source: Yes, delete
fr: Oui, supprimer

source: No, back to the thread
fr: Non, retour au sujet

source: This thread is sticky, it will always show up at the top of the forum.
fr: Ce sujet est épinglé, il apparaîtra toujours en haut du forum.

source: This thread is closed, you cannot post new messages in it.
fr: Ce sujet est fermé, vous ne pouvez pas y poster de nouveaux messages.

source: By <span class="thread-item-author">%(username)s</span> ⋅ <span title="%(date_full)s">%(date)s</span>
fr: Par <span class="thread-item-author">%(username)s</span> ⋅ <span title="%(date_full)s">%(date)s</span>

source: You have to <a href="%(register)s">register</a> or <a href="%(login)s">log in</a> to post messages.
fr: Vous devez vous <a href="%(register)s">enregistrer</a> ou vous <a href="%(login)s">connecter</a> pour poster des messages.

source: Delete thread
fr: Supprimer le sujet

source: Delete the thread
fr: Supprimer le sujet

source: Are you sure you want to delete <strong>%(title)s</strong>?
fr: Confirmez-vous la suppression de <strong>%(title)s</strong>&nbsp;?

source: Move the thread to
fr: Déplacer le sujet dans

source: Unstick the thread
fr: Ne pas mettre en avant

source: Stick the thread
fr: Mettre en avant

source: Open the thread
fr: Ouvrir le sujet

source: Close the thread
fr: Fermer le sujet

source: Reply to the thread
fr: Répondre au sujet

source: %(username)s's profile picture
fr: Photo de profil de %(username)s

source: Staff member
fr: Membre de l'équipe

source: Hide
fr: Cacher

source: Unhide
fr: Ne plus cacher

source: Delete
fr: Supprimer

source: Edited on <span title="%(date_iso)s">%(date)s</span>
fr: Modifié le <span title="%(date_iso)s">%(date)s</span>

source: by %(username)s
fr: par %(username)s

source: Message is deleted.
fr: Message supprimé.

source: Back to top
fr: Retour en haut

source: Add reply
fr: Ajouter une réponse

source: Sorry, you are not allowed to post new messages in this thread.
fr: Vous n'êtes pas autorisé à poster de nouveaux messages dans ce sujet.

source: The post was deleted successfully.
fr: Le message a été supprimé avec succès.

source: The thread was moved successfully.
fr: Le sujet a été déplacé avec succès.

source: The thread was deleted successfully.
fr: Le sujet a été supprimé avec succès.

source: Email address
fr: Adresse e-mail

source: How do you identify?
fr: Comment identifiez-vous ?

source: You have to identify as a girl/woman to apply to the Girls Can Code! summer camps.
fr: Vous devez vous identifier comment une fille/femme pour vous inscrire à un stage Girls Can Code!.

source: <em>I identify as girl/woman.</em>
fr: <em>Je m'identifie comme une fille/femme</em>

source: <em>I identify as boy/man.</em>
fr: <em>Je m'identifie comme un garçon/homme.</em>

source: We need your real name and address for legal reasons, as the Prologin staff engages its responsibility to supervise you during the summer camps.
fr: Nous avons besoin de votre vrai nom et de votre adresse pour des raisons légales : l'association engage sa responsabilité pour vous encadrer lors des épreuves régionales et de la finale.

source: We will send the invitation to the summer camps at this address, so make sure it's valid.
fr: Nous enverrons la convocation aux épreuves régionales à cette adresse, assurez-vous qu'elle soit correcte.

source: You cannot participate if you don't identify as a girl/woman.
fr: Vous ne pouvez pas participer si vous ne vous identifiez pas comme une fille/femme.

source: 1st choice
fr: Premier choix

source: 2nd choice
fr: Deuxième choix

source: 3rd choice
fr: Troisième choix

source: GCC! − Application
fr: GCC! - Inscription

source: Application
fr: Inscription

source: You are missing some key information, you won't be able to validate your application !
fr: Il manque plusieurs informations nécessaires, vous ne pourrez pas valider votre candidature.

source: Application Form
fr: Formulaire d'Inscription

source: Validate and select my wishes
fr: Valider et classer mes choix.

source: GCC! − Applications
fr: GCC! - Inscription

source: Review
fr: Sélection

source: Candidates for %(event.short_description)s (edition %(edition)s)
fr: Candidates pour %(event.short_description)s (edition %(edition)s)

source: View complete profile
fr: complétés uniquement

source: Reject all
fr: Tout refuser

source: Profile
fr: Profil

source: birthdate
fr: Date de naissance

source: previous participations
fr: participations précédentes

source: GCC! − Summary
fr: GCC! - Résumé

source: Summary of applications
fr: Résumé de la candidature

source: Full name
fr: Nom complet

source: Phone number
fr: Téléphone

source: Email address
fr: Adresse e-mail

source: Birth day
fr: Date de naissance

source: Postal address
fr: Adresse postale

source: Date joined
fr: Date d'inscription

source: Member for
fr: Membre depuis

source: Sadly you did not apply yet for the current edition...
fr: Vous n'avez pas encore participé au concours cette année.

source: Apply
fr: Appliquer

source: Edit application
fr: Modifier la candidature

source: Validate application
fr: Enregistrer la candidature

source: Pending
fr: En attente

source: Rejected
fr: Refusée

source: Selected
fr: Selectionnée

source: You will soon receive your assignation.
fr: Nous vous assignerons bientôt à un centre.

source: Accepted
fr: Acceptée

source: You have been assigned to:
fr: Vous avez été assigné à:

source: Please confirm your venue.
fr: Veuillez confirmer votre présence.

source: Confirmed
fr: Confirmée

source: And you confirmed your venue, see you there!
fr: Votre présence a été confirmée, rendez-vous au stage !

source: Validate your application
fr: Enregistrer votre participation

source: Be careful after this you won't be able to change your answers or event wishes.
fr: Soyez prudente, après cela vous ne pourrez plus modifier vos réponse ni l'ordre de vos préférences.

source: Summer camps locations
fr: Lieux de stage

source: Chose my location wishes
fr: Choisir mes lieux de stage

source: Confirm my application
fr: Confirmer ma candidature

source: Available centers
fr: Tous les centres

source: From %(start)s to %(end)s
fr: Du %(start)s au %(end)s

source: Inscription close the %(signup_end)s
fr: L'inscription ce termine le %(signup_end)s

source: Free computer science summer camps for girls under 18.
fr: Stage d'informatique gratuit pour les collégiennes et lycéennes.

source: Home
fr: Accueil

source: Editions
fr: Édition

source: Register
fr: S'inscrire

source: Sign in
fr: Connexion

source: My profile
fr: Mon profil

source: Profile & options
fr: Profil &amp; options

source: My applications
fr: Mes candidatures

source: Sign out
fr: Déconnexion

source: Address
fr: Adresse

source: Mail
fr: E-mail

source: Phone
fr: Téléphone

source: Change locale
fr: Changer la langue

source: Save your preferred locale in your <a href="%(url)s#id_preferred_locale">user settings</a>.
fr: Sauvegardez votre langue préférée dans vos <a href="%(url)s#id_preferred_locale">paramètres</a>.

source: Edition 2018
fr: Édition 2018

source: This year, the organization of a Girls Can Code! at <strong>Nantes</strong> was delegated to the organization Adn-ouest Atlantic 2020. Meanwhile, Prologin organizes the summer camps at <strong>Paris</strong> and <strong>Lyon</strong>.<br /> Those summer camps had a total of <strong>70 girls</strong> and a new practice on <strong>microcontrolers microbit</strong> is created. With the video games tutorial and some activities with the Lego robots it's a great way to practice the skills learned during the week with creativity and fun !
fr: Cette année, l'organisation d’un stage Girls Can Code! à <strong>Nantes</strong> est délégué à l’association Adn-ouest Atlantic 2020. Prologin quant à elle organise à nouveau les stages de <strong>Paris</strong> et <strong>Lyon</strong>.<br /> Ces stages qui accueillent au total <strong>70 participantes</strong> voient l’arrivée d’un TP sur les <strong>microcontrôleurs microbit</strong> qui, avec le TP jeux vidéo, donnent la possibilité d’exprimer sa créativité.

source: Edition 2017
fr: Édition 2017

source: In 2017, Prologin challenges itself to organize 3 Girls Can Code summer camps! One at <strong>Bordeaux</strong> in July and two others at<strong>Paris</strong> and <strong>Lyon</strong> at the same time at the end of august. They received a total of <strong>52 participants</strong> !
fr: En 2017, Prologin se lance un grand défi, l’organisation de 3 stages Girls Can Code!, un à <strong>Bordeaux</strong> en juillet et deux autres à <strong>Paris</strong> et <strong>Lyon</strong> en parallèle pendant la dernière semaine d'août. Ils ont réuni un total de <strong>52 participantes</strong> !

source: Edition 2016
fr: Édition 2016

source: In 2016,the <strong>18 girls</strong> had very different levels, so the camp was split in small groups. This year a new tutorial was created on <strong>Networks</strong>, where each girls creates it's own chat client !
fr: Les <strong>18 participantes</strong> avaient cette année des niveaux très hétéroclites, le stage s’est donc organisé par groupes de niveaux. Le stage a vu l’arrivée d’un <strong>TP réseau</strong> qui consiste en la création d'un petit client de messagerie.

source: Edition 2015
fr: Édition 2015

source: In 2015, there was <strong>12 girls</strong> taking part to the summer camps which for the first time as tutorials on <strong>web programming</strong>, and a small tutorial on <strong>video game creation</strong> with the Pygame library and even an introduction to <strong>Linux</strong>.
fr: En 2015, c’est <strong>12 filles</strong> qui ont pris part à un stage qui initie pour la première fois à des sujets sur le <strong>web</strong>, la création d’un petit <strong>jeux vidéo</strong> avec la bibliothèque pygame ou encore sur l’os <strong>linux</strong>.

source: Edition 2014
fr: Édition 2014

source: This first summer camp hosted <strong>10 participants</strong> for 5 days to introduce to them to programming. Center around algorithmic, we learn to use abstract data structures, for example <strong>graphs</strong>. Among all the participants, two in particular continue to study IT and became organizers as well.
fr: Ce premier stage a accueilli <strong>10 participantes</strong> pendant 5 jours d'initiation à la programmation. Centré autour de l'algorithmique, on y a appris à manipuler des structures de données abstraites, comme par exemples les <strong>graphes</strong>. Parmi les participantes, deux en particulier ont poursuivi leurs études dans l'informatique et sont devenues organisatrices des stages !

source: The Summer Camps
fr: Le Stage

source: The Girls Can Code! Summer camp is an initiation week to programming for teenage girls.
fr: Les stages Girls Can Code! c’est une semaine d'initiation à la programmation pour les collégiennes et lycéennes.

source: Next Summer Camps
fr: Prochains stages

source: the week of
fr: la semaine du

source: To register
fr: Pour vous inscrire

source: For girls without an high school diploma
fr: Être une fille encore non bachelière

source: For European Union or Swiss inhabitants
fr: Pour les ressortissants de l'Union européenne ou en Suisse

source: Complete the application form
fr: Remplir le formulaire de candidature

source: We learn the fundamentals of programming with the Python language, and things to start your own small project ! <br /><br /> Internships are free and organized by volunteers and by the Prologin association.
fr: On y apprend les bases de la programmation en Python, et de quoi commencer son propre projet ! Les stages sont gratuits et les repas offerts aux participantes.

source: More informations
fr: Plus d'informations

source: Everything you have to know about internships
fr: Tous ce qu'il y a à savoir sur le stage

source: For all other question, contact us
fr: Pour toute autre question, contactez nous

source: Prerequisites
fr: Prérequis

source: The internship's goal is to adapt to each of you so you do not have to have a minimal level in IT before the internship. Beside, go take a look to
fr: Le stage a pour but de s’adapter au niveau de chacune donc pas besoin d’avoir un niveau minimum en informatique avant le stage. Par contre, c’est toujours mieux de savoir dans quoi on se lance donc va faire un tour sur

source: some resources
fr: quelques ressources

source: to peek a look at what's coming !
fr: que nous recommandons pour commencer !

source: Free internship
fr: Stage gratuit

source: Internships are free and meals are provided. The association does not provide any accommodation or transportation to the stage place. But if you have any financial issues, send us a mail to
fr: Les stages sont gratuits et les repas offerts aux participantes. L'hébergement et le transport jusqu'au lieu du stage ne sont pas pris en charge par l’association. Mais si des questions financières t’empêcheraient de participer au stage, écris-nous à

source: and we will talk about a possible scholarship.
fr: et nous discuterons de l’attribution éventuelle d’une bourse.

source: For those who cannot apply
fr: Pour celles et ceux qui ne peuvent pas s'inscrire

source: The IT is not closed so far ! Do not hesitate to discover the <ref> recommended resources to start<ref> and if you are less than 21 years old, you can take part to the 27<sup>th</sup> edition
fr: L’informatique ne t’es pas fermé pour autant ! N’hésite pas à découvrir les <ref>ressources recommandées pour débuter<ref> et si tu as moins de 21 ans, tu peux participer à la 27<sup>e</sup> édition

source: of the Prologin contest
fr: du concours Prologin

source: The first online qualification stage is now open.
fr: La première phase de qualification en ligne est ouverte.

source: The program
fr: Le programme

source: Internship last one week during which there is some practical courses on diverse subjects(Python introduction, networks, web), and some conferences where the women speakers work in IT. Finally, the week ends with a small project where creativity is inferred
fr: Le stage dure une semaine pendant laquelle ont lieu différentes activités pédagogiques sur divers sujets tels que introduction à la programmation, réseau, internet et différentes conférences d'intervenantes de l'informatique. Enfin, le week-end se termine par un petit projet faisant appel à la créativité

source: Figures
fr: Chiffres

source: Parity in IT
fr: Parité en informatique

source: Girls Can Code! was created to promote girls to take a place in this masculine field despite stereotypes.
fr: Girls Can Code! a été créé dans le but d'encourager des filles à s'essayer à l'informatique malgré le manque de femmes et les stéréotypes dans le domaine.

source: More
fr: En plus

source: Previous Girls Can Code editions!
fr: Précédentes éditions de Girls Can Code!

source: The first ever Girls Can Code! edition was in 2014, therefore the 2019<sup>th</sup> edition will be the 6<sup>th</sup>.
fr: La toute première édition de Girls Can Code! a eu lieu en 2014, donc l'édition de 2019 sera la 6<sup>ème</sup>.

source: Prologin, an association created in 1991
fr: Prologin, une association créée en 1991

source: Our sponsors
fr: Nos sponsors

source: We would like to thanks our sponsors without whom internships would not happen.
fr: Nous souhaitons remercier nos sponsors, sans lesquels les stages ne pourraient pas être organisés.

source: Any question ?
fr: Des questions ?

source: Do not hesitate to contact us.
fr: N'hésitez pas à nous contacter.

source: Hi! Your subscription to the mailing list of GCC! has been completed. If you wish to unsubscribe from this mailing list you can use the following link: %(baseurl)s%(unsubscribe_url)s Should you have any question, please contact us by sending an email at %(contactmail)s. -- The Prologin staff
fr: Bonjour! Merci de votre inscription sur la mailing list de GCC!. Si vous voulez vous désinscrire de la newsletter, veuillez ouvrir le lien qui suit dans votre navigateur : %(baseurl)s%(unsubscribe_url)s Si vous avez une question, veuillez nous contacter par E-mail à l'adresse suivante: %(contactmail)s. -- L'équipe Prologin

source: Subscription the newsletter of GCC!
fr: Inscription à la newsletter de GCC!

source: Train to code
fr: S'entraîner

source: Many resources are available on the internet to start coding, but it is sometime hard not to get lost in this ocean of informations. We detail here some interesting resources to start learning.
fr: Beaucoup de ressources sont disponibles sur Internet pour te permettre de découvrir l’informatique, mais il est parfois difficile de s'orienter face à la quantité d'informations.

source: Which language ?
fr: Quel langage ?

source: When coding, we describe information that the machine will execute. To be able interact with the machine, we need to choose the language we will write in. There are many existing languages, each with their specificities.
fr: Coder consiste à décrire des opérations que la machine exécutera, et pour communiquer avec la machine on doit choisir au préalable dans quel langage on va lui parler.

source: It's important to know in which language we want to start programming in when starting because we learn to program in a language. During the summer camps we mainly teach Python, which we recommend to start. It's an easy language to start with (compared to other...) and it has many uses. YouTube for example is coded in Python.
fr: Il est important de savoir dans quel langage on souhaite commencer à programmer avant de se lancer. On apprends à programmer dans un langage.

source: Starting
fr: Débuter

source: France-IOI offers a learning platform with exercises organized by level of difficulty, everything accessible completely freely and fully in french !
fr: France-IOI offre une plateforme d'apprentissage avec des exercices répartis par niveaux, le tout gratuitement et entièrement en français !

source: If you speak a bit of English, Codeacademy is a good resource to start programming.
fr: Si tu parles un peu anglais, Codeacademy est une bonne ressource pour te lancer dans la programmation.

source: Keep coding
fr: Continuer à coder

source: The good thing when learning to program, is that it can be used in many ways, to do plenty of things There are a lot of sub domain or application in computer science, and to keep coding, it's more fun to find something we really like Here are some examples:
fr: L’avantage quand on apprend l'informatique, c’est qu'on peut vraiment en faire ce qu’on veut. Il y a beaucoup de sous domaines et d'applications en informatique, et pour continuer à coder, c’est motivant de trouver quelque chose qui nous plait. Voici quelques exemples :

source: They have written a tutorial to create a blog in Python thanks to the Django framework. It has been entirely translated in french and is very accessible. Django is a very powerful tool for web platforms. Both the GCC! and Prologin websites use Django.
fr: Elles ont écrit un tutoriel pour la création d’un blog en Python avec le framework Django. Il a été traduit entièrement en français et est très accessible. Django est un outil très puissant pour le web. Les sites de GCC! et Prologin utilisent d’ailleurs ce framework.
