Repository: prologin/concours-site
Catalog: prologin/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Hi %(username)s! Thanks for you registration on Prologin. In order to complete the process and allow you to sign in, you have to activate your account. Please open the following link in your browser: %(url)s If you cannot click on the link, copy-paste it in your browser address bar. Should you have any question, please contact us by sending an email at %(contactmail)s. -- The Prologin staff
fr: Bonjour %(username)s ! Merci de votre inscription à Prologin. Pour finaliser l'inscription, vous devez activer votre compte. Veuillez ouvrir le lien qui suit dans votre navigateur : %(url)s Si vous ne pouvez pas cliquer sur le lien, copiez-collez le dans la barre d'adresse de votre navigateur. Si vous avez une question, n'hésitez pas à nous contacter à l'adresse %(contactmail)s. -- L'équipe Prologin

source: Activate your Prologin account
fr: Activez votre compte Prologin

source: Hi %(username)s! Somebody requested to reset your password on the Prologin website. If you actually made this request, you can safely go forward and browse to the link below: %(url)s If you cannot click on the link, copy-paste it in your browser address bar. If you did not ask for this password reset, it means a malicious user is trying to access your account. Do not click on the link above, just ignore this request and delete this email. If you keep receiving these password reset emails, please get in touch with our team using the email address below. Should you have any question, please contact us by sending an email at %(contactmail)s. -- The Prologin staff
fr: Bonjour %(username)s ! Quelqu'un a demandé de réinitialiser votre mot de passe sur le site de Prologin. Si vous avez effectivement formulé cette requête, veuillez ouvrir le lien qui suit dans votre navigateur : %(url)s Si vous ne pouvez pas cliquer sur le lien, copiez-collez le dans la barre d'adresse de votre navigateur. Si vous n'avez pas pas demandé cette réinitialisation, cela signifie qu'un utilisateur malveillant tente d'accéder à votre compte. Ne cliquez pas sur le lien ci-dessus, ignorez cet e-mail voire supprimez-le. Si vous continuez à recevoir ce genre de demandes non sollicitées, merci d'entrer en contact avec l'équipe Prologin en nous envoyant un e-mail à l'adresse ci-dessous. Si vous avez une question, n'hésitez pas à nous contacter à l'adresse %(contactmail)s. -- L'équipe Prologin

source: Your Prologin password reset request
fr: Votre demande de réinitialisation de mot de passe sur Prologin

source: Password reset
fr: Réinitialisation du mot de passe

source: Forgotten your password? Enter your email address below, and we'll email instructions for setting a new one.
fr: Mot de passe oublié? Entrez votre adresse email ci-dessous, et nous vous enverrons par email la procédure pour en définir un nouveau.

source: Please choose a username. You must use a valid email address, as you will receive a message to confirm your registration.
fr: Choisissez un nom d'utilisateur. Vous devez utiliser une adresse e-mail valide, vous recevrez un message pour confirmer votre inscription.

source: Edit in admin
fr: Modifier dans l'admin

source: Impersonate
fr: Se faire passer pour cet utilisateur

source: Unsubscribe
fr: Désinscription

source: Unsubscribe from mailing
fr: Désabonnement newsletter

source: If you wish to stop receiving e-mails from Prologin, you can click on the button below.
fr: Si vous souhaitez ne plus recevoir d'e-mails de Prologin, vous pouvez cliquer sur le bouton ci-dessous.

source: Remember: we only mail you to provide useful information during the various stages of the contest. We hate spam as much as you do!
fr: Pour rappel, nous n'envoyons des e-mails que pour vous informer du déroulement du concours. Nous détestons autant que vous les courriers indésirables !

source: Stay subscribed
fr: Conserver l'abonnement

source: <code>%(email)s</code> has already been unsubscribed. You will receive no further e-mails from Prologin.
fr: <code>%(email)s</code> a déjà été désinscrit. Vous ne recevrez plus d'e-mails de Prologin.

source: has been unsubscribed and will receive no further e-mails from Prologin.
fr: a été désinscrit et ne recevra plus d'e-mails de Prologin.

source: Your account was created. We sent an email to %(mail)s so you can confirm your registration.
fr: Votre compte a été créé. Nous avons envoyé un e-mail à %(mail)s pour que vous puissiez confirmer votre inscription.

source: Your account was activated. Enjoy your visit!
fr: Votre compte est activé. Bonne visite&nbsp;!

source: The activation link you provided is invalid or obsolete. If you created your account earlier than %(days)s days ago, you have to create a new one. You may use the same username and email though.
fr: Le lien d'activation que vous avez fourni est invalide ou obsolète. Si vous avez créé votre compte il y a plus de %(days)s jours, vous devez répéter l'opération. Vous pouvez utiliser les mêmes nom d'utilisateur et e-mail.

source: Changes saved.
fr: Modifications enregistrées.

source: New password saved.
fr: Mot de passe modifié.

source: You should receive an email at %(email)s in a few moments. Please follow the instructions to complete the password reset.
fr: Vous devriez recevoir un e-mail à %(email)s dans quelques instants. Veuillez suivre les instructions pour finaliser la réinitialisation du mot de passe.

source: You have been automatically logged in.
fr: Vous avez été connecté automatiquement.

source: Account %(username)s was deleted successfully.
fr: Le compte %(username)s a été supprimé avec succès.

source: Upload new image
fr: Envoyer une nouvelle image
