Repository: prologin/concours-site
Catalog: prologin/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Every problem enforces some limits in terms of memory usage and execution time. Some coefficients are applied on some slower or memory greedy languages. No particular limitation is applied on the stack size.
fr: Chaque sujet impose des limites, autant en terme d'utilisation mémoire que de temps d'exécution. Des coefficients sont néanmoins appliqués sur certains langages plus lents à s'exécuter ou plus gourmand en mémoire. Aucune limitation particulière n'est appliquée sur la taille de la pile.

source: Hardware architecture
fr: Architecture matérielle

source: Your programs are executed in a virtual machine with an %(hardware_cpu)s with a clock rate of %(hardware_clockrate)s and an %(hardware_architecture)s architecture. The byte order is %(hardware_byteorder)s. The virtual machine has %(hardware_ncpu)s dedicated vCPU and %(hardware_mem)s Gio of dedicated random access memory.
fr: Vos programmes sont exécutés dans une machine virtuelle architecturée autour d'un processeur %(hardware_cpu)s cadencé à %(hardware_clockrate)s et une architecture %(hardware_architecture)s. L'architecture est de type %(hardware_byteorder)s. La machine virtuelle a %(hardware_ncpu)s vCPU dédiés et %(hardware_mem)s Gio de mémoire vive dédiés.

source: Compilers and interpreters
fr: Compilateurs et interpréteurs

# manual language table
source: Language
fr: Langage

# manual language table
source: Binary
fr: Binaire

# unknown version
source: <em>unknown</em>
fr: inconnue

source: The program list is temporarily unavailable.
fr: La liste des programmes est temporairement indisponible.

source: Tackled by %(count)s member
fr: Abordé par %(count)s membre

source: Solved by %(count)s member
fr: Résolu par %(count)s membre

source: You solved this problem.
fr: Vous avez résolu ce problème.

source: You tackled this problem without success.
fr: Vous avez abordé ce problème sans succès.

source: Runtime constraints
fr: Contraintes d'exécution

source: Maximum memory usage
fr: Utilisation mémoire maximum

source: %(kb)s&nbsp;kilobytes
fr: %(kb)s&nbsp;kilo-octets

source: Maximum execution time
fr: Temps d'exécution maximum

source: %(ms)s&nbsp;milliseconds
fr: %(ms)s&nbsp;millisecondes

source: Input/output samples
fr: Exemples d'entrée/sortie

source: Sample input
fr: Exemple d'entrée

source: Sample output
fr: Exemple de sortie

source: Note
fr: Commentaire

source: Submit your solution
fr: Proposez votre solution

source: You already solved this problem. You won <strong>%(score)s</strong> points for it, which is %(base)s base points minus %(malus)s malus points.
fr: Vous avez déjà résolu ce problème. Vous avez gagné <strong>%(score)s</strong> points, soit %(base)s points de base moins %(malus)s points de malus.

source: You can also upload a file instead:
fr: Vous pouvez aussi envoyer un fichier&nbsp;:

source: Upload a source file
fr: Envoyer un fichier source

source: Select the programming language:
fr: Sélectionnez le langage de programmation&nbsp;:

source: Insert parsing code stub at the end of your code
fr: Insère un squelette de code à compléter à la fin de votre code

source: Code stub
fr: Code à compléter

source: Optional short summary of your changes
fr: Message facultatif résumant vos modifications

source: Submission history
fr: Historique des soumissions

source: Current version (unsaved)
fr: Version en cours (non soumise)

source: Unknown language
fr: Langage inconnu

source: Just now
fr: À l'instant

source: <em>No summary</em>
fr: <em>Pas de résumé</em>

source: Correct solution
fr: Solution correcte

source: Invalid solution
fr: Solution incorrecte

source: Pending check
fr: Vérification en attente

source: Base points won by solving this problem. Malus points are not taken into account.
fr: Points de base gagnés en résolvant ce problème. Les points de malus ne sont pas pris en compte.

source: You have to <a href="%(register)s">register</a> or <a href="%(login)s">log in</a> to be able to submit your solution.
fr: Vous devez vous <a href="%(register)s">inscrire</a> ou <a href="%(login)s">vous connecter</a> pour soumettre votre solution.

source: Statement
fr: Énoncé

source: Search results
fr: Résultats de la recherche

source: Search training problems
fr: Chercher des problèmes d'entraînement

source: Jump to results
fr: Aller aux résultats

source: Sort
fr: Trier

source: by title
fr: par titre

source: by year
fr: par année

source: by difficulty
fr: par difficulté

source: ascending
fr: croissant

source: or
fr: ou

source: descending
fr: décroissant

source: Problems %(from)s-%(to)s of %(count)s
fr: Problèmes %(from)s-%(to)s sur %(count)s

source: No problem match your query. Try broader criteria.
fr: Aucun problème ne correspond à votre requête. Essayez des critères moins précis.

source: Training
fr: Entraînement

source: Training challenges
fr: Épreuves d'entraînement

source: %(year)s %(challenge)s
fr: %(challenge)s %(year)s

source: This problem was manually made available by the staff
fr: Ce problème a été manuellement rendu disponible par l'équipe

source: This problem was automatically made available because you did not complete any next-level problem
fr: Ce problème a été automatiquement rendu disponible car vous n'avez pas réussi de problème du niveau supérieur

source: Failed
fr: Échoué

source: Not submitted
fr: Non soumis

source: Search problems
fr: Rechercher des problèmes

source: From
fr: De

source: to
fr: à

source: Search
fr: Rechercher

source: Test skipped.
fr: Test ignoré.

source: Run time
fr: Temps d'exécution

source: Memory
fr: Mémoire

source: Test passed!
fr: Test passé&nbsp;!

source: Test failed:
fr: Test échoué :

source: The output is incorrect (details of this test are hidden).
fr: La sortie est incorrecte (les détails de ce test sont cachés).

source: Expected standard output:
fr: Sortie standard attendue :

source: Standard output of your program:
fr: Sortie standard du programme :

source: Standard error of your program:
fr: Sortie d'erreur du programme :

source: Submission for %(problem)s
fr: Soumission pour %(problem)s

source: Submitted by <strong>%(username)s</strong>
fr: Soumise par <strong>%(username)s</strong>

source: Programmed in <strong>%(lang)s</strong>
fr: Programmée en <strong>%(lang)s</strong>

source: Submitted on <strong title="%(short_date)s">%(date)s</strong>
fr: Soumise le <strong title="%(short_date)s">%(date)s</strong>

source: No summary.
fr: Pas de résumé.

source: Not correctable
fr: Non corrigeable

source: Solution passes tests
fr: La solution passe les tests

source: Solution is invalid
fr: La solution est invalide

source: Not corrected yet
fr: Pas encore corrigée

source: Points won
fr: Points gagnés

source: Every time you submit a solution that fails (ie. does not compile or does not pass all the tests), malus points are increased by a value proportional to the problem level and the number of attempts.
fr: À chaque soumission échouée (qui ne compile pas ou qui ne passe pas tous les tests), les points de malus sont incrémentés d'une valeur proportionnelle au niveau de l'exercice et au nombre d'essais.

source: Edit and submit again
fr: Modifier et re-soumettre

source: Resend to correction
fr: Renvoyer en correction

source: Last corrected on
fr: Dernière correction le

source: Solution code
fr: Code de la solution

source: Compiler standard error output:
fr: Sortie d'erreur du compilateur :

source: Correction tests
fr: Tests de correction

source: Performance tests
fr: Tests de performance

source: There are no such tests for this problem.
fr: Il n'y a aucun test de ce type pour cet exercice.

source: The submission can not be corrected as it was written in a language that can not be compiled nor executed.
fr: La soumission ne peut pas être corrigée car elle a été écrite dans un langage qui ne peut pas être compilé ou exécuté.

source: Submission results are not available anymore. This is because the code was submitted a long time ago. You can still try to submit your code again using the “Edit and submit again” button.
fr: Les résultats de la soumission ne sont plus disponibles parce que le code a été soumis il y a trop longtemps. Vous pouvez toujours essayer de soumettre votre solution en utilisant le boutton «&nbsp;Modifier et re-soumettre&nbsp;».

source: This submission is pending correction. This can take from a few seconds to some minutes.
fr: La soumission est en cours de correction. Cela peut prendre de quelques secondes à plusieurs minutes.

source: Your browser does not support Javascript. You will have to manually reload this page once in a while to check if results have arrived.
fr: Votre navigateur ne supporte par Javascript. Vous devez manuellement rafraîchir cette page de temps en temps pour vérifier si les résultats sont arrivés.

source: Camisole request
fr: Requête envoyée à camisole

source: Camisole result
fr: Résultat reçu de camisole

source: Male
fr: Homme

source: Female
fr: Femme

source: Gender
fr: Genre

source: Coding language
fr: Langage de programmation

source: Postal code
fr: Code postal

source: City
fr: Ville

source: Country
fr: Pays

source: English
fr: Anglais

source: French
fr: Français

source: The request you have made is invalid or malformed.
fr: La requête que vous avez formulée est invalide ou malformée.

source: You do not have the permission to access this content.
fr: Vous n'avez pas l'autorisation d'accéder à ce contenu.

source: You do not have the permission to access this content. Try to <a href="%(url)s">sign in</a>.
fr: Vous n'avez pas l'autorisation d'accéder à ce contenu. Essayez de <a href="%(url)s">vous connecter</a>.

source: The resource you asked for does not longer exist, or never has.
fr: La ressource que vous avez demandée n'existe plus ou n'a jamais existé.

source: You could use our search engine to find the content you are looking for.
fr: Vous pouvez utiliser notre moteur de recherche pour trouver le contenu qui vous intéresse.

source: Some internal server error happened. You did nothing wrong, we are to be blamed! Our team has been notified of the issue.
fr: Une erreur interne au serveur est survenue. Vous n'avez rien fait de mal, c'est de notre faute ! Notre équipe a été prévenue du problème.

source: Please try again later.
fr: Veuillez réessayer plus tard.

source: Undergoing maintenance
fr: En cours de maintenance

source: Prologin, the French computing contest
fr: Prologin, le concours national d'informatique

source: Prologin is undergoing a short maintenance
fr: Prologin subit actuellement une courte maintenance

source: We are doing internal maintenance operations for which we have to temporally shut down access to the website.
fr: Nous réalisons des opérations de maintenance internes qui nous obligent à couper temporairement l'accès au site web.

source: We are sorry for the inconvenience. The operation should last only a few minutes. Please come visit us in a moment!
fr: Nous nous excusons pour la gêne occasionnée. Cette opération ne devrait durer que quelques minutes. Revenez nous voir dans un petit moment !

source: Error %(number)s
fr: Erreur %(number)s

source: You can go back to the <a href="%(url)s">home page</a>.
fr: Vous pouvez retourner à <a href="%(url)s">l'accueil</a>.

# Twitter message, LESS THAN 140 CHARS
source: Prologin is a computer science contest, introducing students to the world of programming and algorithms with exciting challenges.
fr: Prologin, le concours d'informatique : faire découvrir la programmation et l'algorithmique aux étudiants grâce à des challenges excitants !

source: Latest blog articles
fr: Dernières actualités

source: No user matching query
fr: Aucun utilisateur correspondant

source: Contact us
fr: Contactez-nous

source: Report a bug on the website
fr: Signaler un problème sur le site

source: Press kit
fr: Kit de presse

source: Terms
fr: Conditions

source: Stay tuned!
fr: Suivez nous !

source: Prologin news Atom stream
fr: Flux Atom des actualités Prologin

source: Prologin on Facebook
fr: Prologin sur Facebook

source: Prologin on Twitter
fr: Prologin sur Twitter

source: Save your preferred locale in your <a href="%(url)s#id_preferred_locale">user settings</a>.
fr: Sauvegardez votre langue préférée dans vos <a href="%(url)s#id_preferred_locale">paramètres</a>.

source: Participate
fr: Participer

source: Discover
fr: Découvrir

source: Train
fr: S'entraîner

source: Django administration
fr: Administration de Django

source: Search users
fr: Chercher des utilisateurs

source: Profile &amp; settings
fr: Profil &amp; options

source: Close
fr: Fermer

source: Exit session
fr: Terminer la session

source: You are currently browsing on behalf of <strong>%(user)s</strong>. Keep focused.
fr: Vous naviguez actuellement sous l'identité de <strong>%(user)s</strong>. Restez alerte.

source: First
fr: Premier

source: Previous
fr: Précédent

source: Next
fr: Suivant

source: Last
fr: Dernier

source: truncated to %(length)s characters
fr: tronquée à %(length)s caractères

# File size suffix
source: B
fr: o

# File size unit
source: bytes
fr: octets

source: year
fr: année

source: month
fr: mois

source: day
fr: jour

source: Your current password
fr: Votre actuel mot de passe

source: Wrong password.
fr: Mot de passe incorrect.

source: Answers
fr: Réponses

source: Correct propositions
fr: Propositions correctes

source: Answer %(id)s: %(answer)s
fr: Réponse %(id)s: %(answer)s

source: Answer %(id)s
fr: Réponse %(id)s

source: Is correct
fr: Est correct

source: Put your answer here
fr: Écrivez votre réponse ici

source: I don't know
fr: Je ne sais pas

source: Question body
fr: Corps de la question

source: Verbose description
fr: Description supplémentaire

source: Answer
fr: Réponse

source: Textual answer
fr: Réponse texte

source: Quiz
fr: Questionnaire

source: Qualification quiz – Prologin %(year)s
fr: Questionnaire de qualification – Prologin %(year)s

source: Please answer the following questions. There is only one correct answer for each question.
fr: Veuillez répondre aux questions suivantes. Il n'y qu'une seule bonne réponse à chaque question.

source: Correct answers give one point, wrong ones remove one point. Not answering a question neither gives nor removes any point.
fr: Une réponse correcte donne un point, une fausse retire un point. Ne pas répondre correspond à zéro point.

source: You have to <a href="%(register)s">register</a> or <a href="%(login)s">log in</a> to be able to fill the quiz.
fr: Vous devez <a href="%(register)s">créer un compte</a> ou <a href="%(login)s">vous connecter</a> pour pouvoir compléter le questionnaire.

source: Correct answer:
fr: Bonne réponse&nbsp;:

source: Save the new answers
fr: Enregistrer les nouvelles réponses

source: Check your answers
fr: Vérifiez vos réponses

source: Your new answers have been saved.
fr: Vos nouvelles réponses ont été enregistrées.

source: Total contestant count
fr: Candidats

source: Current edition contestant count
fr: Candidats pour l'édition en cours

source: Merge selected schools…
fr: Fusionner les établissements sélectionnés…

source: Add to merge
fr: Ajouter à la fusion

source: school
fr: établissement

source: schools
fr: établissements

source: Merge schools
fr: Fusionner les établissements

source: Schools to merge
fr: Établissements à fusionner

source: Acronym
fr: Acronyme

source: Academy
fr: Académie

source: Approved
fr: Approuvé

source: Improved
fr: Importé

source: Use as base
fr: Utiliser comme base

source: Used as base
fr: Utilisé comme base

source: Exclude
fr: Exclure

source: Update merged school
fr: Modifier l'établissement de fusion

source: This merge will delete %(school_count)s schools and update the school for %(contestant_count)s contestants.
fr: Cette fusion va supprimer %(school_count)s établissements et mettre à jour l'établissement de %(contestant_count)s candidats.

source: You can select all contestants using Ctrl-A.
fr: Vous pouvez sélectionner tous les candidats avec Ctrl-A.

source: Unlocked <em>{problem}</em> for {created} users; {existing} unlocks were already set.
fr: Déverrouillage de <em>{problem}</em> pour {created} candidats&nbsp;; {existing} déblocages étaient déjà en place.

source: Regional event challenges
fr: Épreuves régionales

source: Regional event at %(center)s
fr: Épreuve régionale à %(center)s

source: Regional event monitoring
fr: Surveillance épreuve régionale

source: Monitoring
fr: Surveillance

source: Unlocking
fr: Déblocage

source: Unlock selected contestants
fr: Débloquer les candidats sélectionnés

source: Welcome
fr: Bienvenue

source: Welcome to Prologin regional event! You can start <a href="%(url_problems)s">solving problems</a> or browse the <a href="%(url_scoreboard)s">live scoreboard</a>.
fr: Bienvenue à votre épreuve régionale Prologin&nbsp;! Vous pouvez commencer à <a href="%(url_problems)s">résoudre des problèmes</a> ou consulter <a href="%(url_scoreboard)s">le classement temps-réel</a>.

source: Good luck, and don't forget to have fun.
fr: Bonne chance, et n'oubliez pas de passer un bon moment.

source: Monitoring board
fr: Tableau de bord

source: Primary actions
fr: Actions principales

source: Unlock first problem for everybody
fr: Débloquer le premier problème pour tout le monde

source: Level
fr: Niveau

# Lines of code
source: LoC
fr: LdC

source: Password
fr: Mot de passe

source: Unlock
fr: Débloquer

source: No problem tackled yet
fr: Pas de problème abordé

source: Live scoreboard
fr: Classement temps-réel

source: Auto-update
fr: M-à-j auto

source: Refresh scoreboard
fr: Actualiser le classement

source: Fullscreen
fr: Plein écran

source: Exit fullscreen
fr: Sortir du plein écran

source: Sign in with your credentials
fr: Connexion

source: Active
fr: Actif

source: Role
fr: Rôle

source: Role significance
fr: Importance du rôle

# male role
source: President
fr: Président

# female role
source: President
fr: Présidente

# male title
source: The President
fr: Le président

# female title
source: The President
fr: La présidente

# male role
source: Vice President
fr: Vice-président

# female role
source: Vice President
fr: Vice-présidente

# male title
source: The Vice President
fr: Le vice-président

# female title
source: The Vice President
fr: La vice-présidente

# male role
source: Treasurer
fr: Trésorier

# female role
source: Treasurer
fr: Trésorière

# male role
source: Secretary
fr: Secrétaire

# female role
source: Secretary
fr: Secrétaire

# male role
source: Technical Lead
fr: Responsable technique

# female role
source: Technical Lead
fr: Responsable technique

# male role
source: Scientific Lead
fr: Responsable scientifique

# female role
source: Scientific Lead
fr: Responsable scientifique

# male role
source: Vice Treasurer
fr: Vice-trésorier

# female role
source: Vice Treasurer
fr: Vice-trésorière

# male role
source: Member
fr: Membre

# female role
source: Member
fr: Membre

# male role
source: Persistent Member
fr: Membre persistant

# female role
source: Persistent Member
fr: Membre persistant

# male role
source: Mascot
fr: Mascotte

# female role
source: Mascot
fr: Mascotte

# male role
source: External organizer
fr: Organisateur externe

# female role
source: External organizer
fr: Organisatrice externe

source: Team member
fr: Membre de l'équipe

source: Team members
fr: Membres de l'équipe

source: Teams
fr: Équipes

source: Staff %(year)s
fr: Équipe %(year)s

source: Staff %(year)s <small>%(count)s members</small>
fr: Équipe %(year)s <small>%(count)s membres</small>

source: Picture
fr: Photo

source: Public identity
fr: Identité publique

source: Settings
fr: Préférences

source: %(year)s final home
fr: “home” de la finale %(year)s

source: You can not change your details during the contest. If there is an important change you want to make, please contact the staff.
fr: Vous ne pouvez pas modifier vos informations pendant le concours. Si vous devez effectuer un changement, veuillez contacter l'équipe.

source: Public homes
fr: “Homes” publiques

source: Checked editions will make the files available for download to anyone.
fr: Les éditions cochées rendront vos fichiers téléchargeables par tout le monde.

source: Please check the box above and complete the additional tasks if any. This is required to fight spamming bots on the website.
fr: Veuillez cocher la case ci-dessus et réaliser les éventuelles opérations supplémentaires. Cela permet de se prémunir des robots.

source: This username is already in use. Please supply a different username.
fr: Ce nom d'utilisateur est déjà utilisé. Merci d'en choisir un autre.

source: This email address is already in use. Please supply a different email address.
fr: Cette adresse e-mail est déjà utilisée. Merci d'en choisir une autre.

source: Your email address
fr: Votre adresse e-mail

source: Username or email
fr: Nom d'utilisateur ou e-mail

source: This field is case insensitive. It means capitals and small letters are considered to be equal.
fr: Ce champ est insensible à la casse. Cela signifie qu'il n'y a pas de différence entre majuscules et minuscules.

source: Please enter a correct username (or email) and password.
fr: Saisissez un nom d'utilisateur (ou adresse e-mail) et un mot de passe corrects.

source: Your username
fr: Votre nom d'utilisateur

source: Type your username to confirm you know what you are doing.
fr: Saisissez votre nom d'utilisateur pour confirmer que vous réalisez ce que vous allez faire.

source: Wrong username.
fr: Nom d'utilisateur incorrect.

source: Middle school
fr: Collège

source: High school
fr: Lycée

source: Bac+6 and after
fr: Bac+6 et au delà

source: Former student
fr: Ancien étudiant

source: Educational stage
fr: Niveau scolaire

source: Allow Prologin to send me emails
fr: Autoriser Prologin à m'envoyer des e-mails

source: We only mail you to provide useful information during the various stages of the contest. We hate spam as much as you do!
fr: Nous n'envoyons des e-mails que pour vous informer du déroulement du concours. Nous détestons autant que vous les courriers indésirables !

source: Preferred coding language
fr: Langage de programmation préféré

source: Time zone
fr: Fuseau horaire

source: Locale
fr: Langue

source: Profile picture
fr: Photo de profil

source: Official member picture
fr: Photo de profil officielle

source: Members
fr: Membres

source: Password reset confirmation
fr: Confirmation de mise à jour du mot de passe

source: Please enter your new password twice so we can verify you typed it in correctly.
fr: Veuillez entrer votre mot de passe deux fois pour confirmation

source: Change my password
fr: Changer mon mot de passe

source: This action <strong>cannot be reverted</strong>, in compliance with GDPR article 17. You will be logged out immediately after clicking the button below. To proceed, provide your username and password and confirm.
fr: Cette action <strong>ne peut pas être annulée</strong>, conformément l'article 17 du RGPD. Vous serez immédiatement déconnecté⋅e après avoir cliqué sur le bouton ci-dessous. Pour continuer, fournissez votre nom d'utilisateur, votre mot de passe et confirmez.

source: Need an account?
fr: Vous n'avez pas encore de compte&nbsp;?

source: You can create a new account anytime. It's free, you just need an email address.
fr: Vous pouvez créer un compte à tout moment. C'est gratuit, vous avez uniquement besoin d'une adresse e-mail.

source: Register now
fr: S'inscrire

source: Forgot your password?
fr: Mot de passe oublié&nbsp;?

source: No worries. We can send you an email to reset your password.
fr: Pas de souci. Nous pouvons vous envoyer un e-mail pour réinitialiser votre mot de passe.

source: Reset password
fr: Réinitialiser mon mot de passe
