Repository: prologin/concours-site
Catalog: prologin/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Final scoreboard
fr: Classement de la finale

source: Final scoreboard for Prologin %(year)s final
fr: Classement de la finale de Prologin %(year)s

source: Looking for Prologin's last year poster? 1996 final's statement? 2003 quiz? You can find all the documents and photo albums from past Prologin editions in these pages.
fr: Vous recherchez l'affiche du dernier Prologin&nbsp;? L'énoncé de la finale de 1996&nbsp;? Le QCM de 2003&nbsp;? Vous trouverez sur ces pages l'ensemble des documents et albums photo des précédentes éditions de Prologin.

source: Download poster
fr: Télécharger l'affiche

source: Poster not available
fr: Affiche indisponible

source: %(count)s-question quiz
fr: QCM à %(count)s question

source: %(count)s problem
fr: %(count)s problème

source: Test statement (PDF)
fr: Énoncé (PDF)

source: Test correction (PDF)
fr: Correction (PDF)

source: Test Challenge correction (PDF)
fr: Correction des challenges (PDF)

source: Sorry, no resource available.
fr: Désolé, aucune ressource disponible.

source: Regional events
fr: Épreuves régionales

source: Regional events report
fr: Rapport des épreuves régionales

source: Final
fr: Finale

source: Final report
fr: Rapport de la finale

source: Scoreboard
fr: Classement

source: Video
fr: Vidéo

source: Watch the video
fr: Regarder la vidéo

source: Cover photo
fr: Photo d'illustration

source: Browse the %(count)s photos
fr: Parcourir les %(count)s photos

source: Rank
fr: Rang

source: Contestant
fr: Participant

source: Report for %(event)s %(year)s
fr: Rapport pour %(event)s %(year)s

source: Geocode selected centers
fr: Géolocaliser les centres sélectionnés

source: Normalize selected center addresses
fr: Normaliser les adresses des centres sélectionnés

source: Center
fr: Centre

source: Hotel
fr: Hôtel

source: Pizzeria
fr: Pizzéria

source: Other
fr: Autre

source: Manager
fr: Responsable

source: The exam centers
fr: Les centres d'examen

source: You need Javascript to display the map.
fr: Vous avez besoin d'activer Javascript pour afficher la carte.

source: Center address
fr: Adresse du centre

source: Show
fr: Montrer

source: Full map
fr: Plein format

source: Generate convocations
fr: Générer les convocations

source: Edition
fr: Édition

source: Qualification scores
fr: Scores des qualifications

source: Regionale scores
fr: Scores de la régionale

source: Finale scores
fr: Score de la finale

source: %(user)s in edition %(year)s
fr: %(user)s pour l'édition %(year)s

source: User
fr: Utilisateur

source: Programming language
fr: Langage de programmation

source: Correct
fr: Corriger

source: Assigned regional event
fr: Épreuve régionale assignée

source: Assignation status
fr: Statut d'assignation

source: Contestant is not assigned
fr: Le candidat n'est pas assigné

source: I am <strong>not</strong> a student at EPITA.
fr: Je ne suis <strong>pas</strong> étudiant à EPITA.

source: How do you prefer to be described?
fr: Comment préférez-vous qu'on parle de vous ?

source: <em>She is writing code for the contest</em>
fr: <em>Elle écrit du code pour le concours.</em>

source: <em>He is writing code for the contest</em>
fr: <em>Il écrit du code pour le concours.</em>

source: Other or prefer not to tell
fr: Autre ou préfère ne pas le dire

source: Students from EPITA are <a href="%(url)s">not allowed</a> to join the contest.
fr: Les étudiant(e)s de EPITA <a href="%(url)s">ne peuvent pas participer</a> au concours.

source: We need your real name and address for legal reasons, as the Prologin staff engages its responsibility to supervise you during the regional events and the finale.
fr: Nous avons besoin de votre vrai nom et de votre adresse pour des raisons légales : l'association engage sa responsabilité pour vous encadrer lors des épreuves régionales et de la finale.

source: We will send the invitation to the regional events at this address, so make sure it's valid.
fr: Nous enverrons la convocation aux épreuves régionales à cette adresse, assurez-vous qu'elle soit correcte.

source: Format: %(format)s
fr: Format&nbsp;: %(format)s

source: You can modify or review all your personal information on your <a href="%(url)s">profile page</a>.
fr: Vous pouvez modifier ou vérifier vos informations personnelles sur votre <a href="%(url)s">page de profil</a>.

source: Optional.
fr: Optionnel.

source: You cannot participate if you are an EPITA student
fr: Vous ne pouvez pas participer si vous étudiez à EPITA.

source: Your school
fr: Votre établissement scolaire

source: Regional event center wishes
fr: Choix de centres d'examen pour les épreuves régionales

source: This is where you would like to seat the regional events if you are selected. Choose at least one and up to three wishes, in order of preference. Most of the time, we are able to satisfy your first choice.
fr: Établissez la liste des vœux des centres où vous souhaitez passer l'épreuve régionale. Faites au moins un vœu et jusqu'à trois vœux. Vous obtiendrez très probablement votre premier vœu.

source: Regional event
fr: Épreuve régionale

source: Not assigned
fr: Non assigné

source: Ruled out
fr: Éliminé

source: Assigned
fr: Assigné

source: Abandoned
fr: Désisté

source: Another programming contest
fr: Par un autre concours de programmation

source: From social media
fr: Par les réseaux sociaux

source: From the poster in my school/university
fr: Par l'affiche dans mon école/université

source: From a friend
fr: Par un ami ou une amie

source: From an article on a website or a newspaper
fr: Dans un article sur un site ou dans un journal

source: Some other way
fr: Autre

source: I don't remember
fr: Je ne m'en souviens plus

source: T-shirt size
fr: Taille du t-shirt

source: Choose your size
fr: Choisissez votre taille

source: We usually provide unisex Prologin t-shirts to the finalists.
fr: Nous fournissons le plus souvent des t-shirts unisexe aux finalistes.

source: The programming language you will most likely use during the regional events.
fr: Le langage de programmation que vous utiliserez le plus probablement pour l'épreuve régionale.

source: How did you learn about the contest ?
fr: Comment avez-vous découvert le concours ?

source: Tell us how you discovered the contest
fr: Dites nous comment vous avez découvert le concours

source: Regional event assignation status
fr: Assignation d'épreuve régionale

source: Regional event assignation whishes
fr: Vœux d'assignation épreuve régionale

source: Regional event assigned event
fr: Événement assigné pour l'épreuve régionale

source: Final assignation status
fr: Assignation de finale

source: Quiz score
fr: Score du quiz

source: Algo exercises score
fr: Score des exercices d'algo

source: Bonus score
fr: Score bonus

source: Written exam score
fr: Score de l'épreuve écrite

source: Interview score
fr: Score de l'entretien

source: Machine exam score
fr: Score de l'épreuve machine

source: A reason for your changes and/or a comment about the submission
fr: Une explication de vos changements et/ou un commentaire sur la soumission

source: Changelog comment
fr: Commentaire de changelog

source: Unassigned
fr: Non assigné

source: Regional event assignation event is required if contestant is assigned.
fr: L'assignation à une épreuve régionale est requise si le candidat est assigné.

source: Contest
fr: Concours

source: Leaderboard
fr: Classement

source: Inter-school challenge
fr: Challenge des établissements scolaires

source: What is this about?
fr: Qu'est-ce que c'est&nbsp;?

source: This is the list of the schools competing in the inter-school challenge for this edition of Prologin. “Final score” is the sum of the scores obtained by the school students.
fr: Voici la liste des établissements (collèges, lycées, universités, écoles, etc.) qui participent au challenge pour cette édition de Prologin. Le score final d'un établissement est la somme des scores obtenus par ses étudiants.

source: Start <a href="%(url)s">solving challenges</a> to score points for your school!
fr: Commencez à <a href="%(url)s">résoudre des problèmes</a> pour rapporter des points à votre établissement&nbsp;!

source: The rules
fr: Les règles

source: We remind you that you are not allowed to share your solution with other contestants, including friends or fellow students. The Prologin staff reviews all code submissions; if we find evidences of plagiarism, your school may be disqualified from the challenge.
fr: Nous vous rappelons qu'il est interdit de partager vos solutions avec d'autres candidats, même vos amis et camarades. L'équipe Prologin passe en revue toutes les soumissions de code&nbsp;; si nous venions à trouver des plagiats, votre établissement pourrait en conséquence être disqualifié du challenge.

source: The outcome of this challenge has no implication on your personal results. Your involvement in the inter-school challenge is optional.
fr: L'issue de ce challenge n'a pas d'incidence sur vos résultats personnels. Votre investissement dans le challenge inter-établissements est optionnel.

source: %(count)s schools
fr: %(count)s établissements

source: School name
fr: Nom de l'établissement

source: Student count
fr: Nombre d'étudiants

source: Problems solved
fr: Problèmes résolus

source: Final score
fr: Score final

source: No school is competing yet.
fr: Aucun établissement ne participe pour le moment.

source: Application summary
fr: Résumé de la candidature

source: Application summary – Prologin %(year)s
fr: Résumé de la candidature – Prologin %(year)s

source: Application summary for Prologin %(year)s
fr: Résumé de la candidature pour Prologin %(year)s

source: Thanks for joining the Prologin contest this year! This page sums up the requirements you have to fulfill so you can be selected to participate in the next step: <a href="%(about_regional_url)s">regional events</a>.
fr: Merci de participer à Prologin cette année ! Cette page résume les informations que vous devez fournir pour espérer participer à la prochaine étape : les <a href="%(about_regional_url)s">épreuves régionales</a>.

source: The qualification step ends <strong>%(end_date)s</strong>.
fr: L'étape de sélection prend fin le <strong>%(end_date)s</strong>.

source: Your participation is valid. You can still make changes to your answers and profile information, but be sure to keep all the lights green on this page.
fr: Votre participation est valide. Vous pouvez encore modifier vos réponses et coordonnées, mais assurez-vous que toutes les boîtes de cette page restent vertes.

source: Your participation is valid and will be processed for the next step, but to improve your odds of being selected, you should complete the missing bits.
fr: Votre participation est valide et sera considérée pour la prochaine étape, mais pour améliorer vos chances d'être sélectionné(e), il serait bon de compléter les challenges manquants.

source: You are still missing some mandatory information to be able to contest this year. Please review the missing bits on this page.
fr: Il manque des informations obligatoires pour pouvoir participer cette année. Vérifiez de n'avoir oublié aucun champ ci-dessous.

source: Complete
fr: Complet

source: Incomplete
fr: Incomplet

source: Not tackled
fr: Non abordé

source: The quiz
fr: Le questionnaire

source: There is %(count)s quiz question this year.
fr: Il y a %(count)s question de QCM cette année.

source: You completed %(count)s question.
fr: Vous avez répondu à %(count)s question.

source: Review answers
fr: Revoir les réponses

source: Complete answers
fr: Compléter les réponses

source: Although you are not required to answer all questions, it is recommended to answer as many as you can to improve you chances of being selected.
fr: Même si vous n'êtes pas dans l'obligation de répondre à toutes les questions, il est recommandé de répondre à un maximum d'entre elles pour augmenter vos chances.

source: The problems
fr: Les problèmes

source: There is %(count)s problem this year.
fr: Il y a %(count)s problème cette année.

source: You tackled %(count)s problem.
fr: Vous avez abordé %(count)s problème.

source: Review submissions
fr: Revoir les soumissions

source: Complete submissions
fr: Compléter les soumissions

source: Your submissions do not have to pass all the tests. Nevertheless, the jury will favor codes that both compile, answer the statement and have a minimal runtime/memory complexity. You are even free to submit pseudo-code but keep in mind that you will have to write actual code for the regional events and the finale.
fr: Vos soumissions n'ont pas à passer tous les tests. Toutefois, le jury privilégiera les codes qui compilent, répondent à l'énoncé et ont une complexité temporelle, et mémoire, minimale. Vous pouvez même soumettre du pseudo-code, mais gardez à l'esprit que vous devrez écrire du vrai code pour les épreuves régionales et la finale.

source: The inter-school challenge
fr: Le challenge des établissements scolaires

source: If your school does not appear in the list, type its full name and choose the first item: “Add a new school”.
fr: Si votre école n'apparaît pas dans la liste, écrivez son nom complet et choisissez le premier élément: «Ajouter un nouvel établissement».

source: I participate in the #Prologin inter-school challenge!
fr: Je participe au challenge #Prologin des établissements scolaires !

source: Help your school go up in the inter-school rankings!
fr: Aidez votre établissement scolaire à grimper dans le classement&nbsp;!

source: If you are a student, fill in the name of your high school or university. The points you score for solving this year problems will be accounted for your school total score.
fr: Si vous êtes étudiant, saisissez le nom de votre établissement. Les points que vous gagnerez en résolvant les problèmes de cette année seront pris en compte dans le score de votre école.

source: Rules & leaderboard
fr: Règles & classement

source: Preparing the next steps
fr: Préparer les étapes suivantes

source: Save application
fr: Enregistrer la participation

source: Make your choice
fr: Faites votre choix

source: Add new school
fr: Ajouter un établissement

source: Choose an existing school or add yours
fr: Choisissez un établissement existant ou ajoutez le vôtre

source: Events for Prologin %(year)s
fr: Événements pour Prologin %(year)s

source: Event type
fr: Type d'évènement

source: Contestants
fr: Candidats

source: Submissions
fr: Soumissions

source: Unknown corrector
fr: Correcteur inconnu

source: No comment.
fr: Sans commentaire.

# As in nullified
source: Set to none
fr: Mis à zéro

source: Save changes
fr: Sauvegarder les changements

source: Problem submissions
fr: Soumissions de problèmes

source: Level %(level)s
fr: Niveau %(level)s

source: Open fullpage and submit again
fr: Version complète (re-soumettre)

source: Open fullpage
fr: Version complète

source: No submission for this problem.
fr: Pas de soumission pour ce problème.

source: Code score:
fr: Score code&nbsp;:

source: Final score:
fr: Score final&nbsp;:

source: tests passed
fr: tests passés

source: unsuccessful
fr: échoué

source: Correction form
fr: Formulaire

source: Currently correcting
fr: En train de corriger

source: The presence service is down!
fr: Le service de présence est en panne&nbsp;!

source: Correction history
fr: Historique de correction

source: Not corrected yet.
fr: Pas encore corrigé.

source: In the meantime, value changed to %%s
fr: Entre-temps, la valeur est devenue %%s

source: Quiz results
fr: Résultats du QCM

source: Quiz answers
fr: Réponses du QCM

source: Correction index
fr: Sommaire de correction

source: Event
fr: Événement

source: Browse
fr: Parcourir

source: Show:
fr: Afficher&nbsp;:

source: everything
fr: tout

source: complete only
fr: complétés uniquement

source: Changes saved successfully.
fr: Modifications enregistrées avec succès.

source: You are missing some mandatory information.
fr: Il manque des informations obligatoires.

source: You need to specify more wishes for your semifinal center.
fr: Vous devez spécifier davantage de vœux pour votre centre d'épreuve régionale.

source: You cannot participate if you are born before %(year)s.
fr: Vous ne pouvez pas participer si vous êtes né avant %(year)s.

source: First choice
fr: Premier choix

source: Second choice
fr: Deuxième choix

source: Third choice
fr: Troisième choix

source: Choice
fr: Choix

source: You must provide at least %(count)d choice.
fr: Vous devez fournir au moins %(count)d choix.

source: all-centers
fr: tous-centres

source: JSON export file
fr: Fichier export JSON

source: Select the JSON export file obtained from regional event website and proceed.
fr: Sélectionnez le fichier export JSON obtenu du site d'épreuve régionale et continuez.

source: Invalid format: could not read or deserialize %(type)s
fr: Format invalide&nbsp;: impossible de lire ou de dé-serialiser %(type)s

source: Imported edition is invalid.
fr: L'édition importée est invalide.

source: Imported center is invalid.
fr: Le centre importé est invalide.

source: Imported event is invalid.
fr: L'événement importé est invalide.

source: Imported event edition or center mismatches with known event.
fr: L'édition ou le centre importé ne correspond pas à l'événement connu.

source: Imported users mismatch.
fr: Les utilisateurs importés ne correspondent pas.

source: Monday
fr: Lundi

source: Tuesday
fr: Mardi

source: Wednesday
fr: Mercredi

source: Thursday
fr: Jeudi

source: Friday
fr: Vendredi

source: Saturday
fr: Samedi

source: Sunday
fr: Dimanche

source: Morning
fr: Matin

source: Noon
fr: Midi

source: Evening
fr: Soir

source: Day
fr: Jour

source: Starting ID
fr: ID départ

source: Names
fr: Noms

source: One name per line
fr: Un nom par ligne

source: Custom Badges
fr: Badges personnalisés

source: Submit
fr: Envoyer

source: %(year)s documents
fr: Documents de %(year)s

source: Document index
fr: Sommaire des documents

source: Data import
fr: Import de données

source: All centers
fr: Tous les centres

source: Passwords
fr: Mots de passe

source: Portrayal agreement
fr: Droit à l'image

source: Data export
fr: Export données

source: Participation Authorization
fr: Autorisation de participation

source: Equipment Liability Release
fr: Décharge dégâts matériels

source: Emergency Call List
fr: Liste numéros d'urgence

source: External organizers
fr: Organisateur externes

source: Diplomas
fr: Diplômes

source: There is no final event for this edition.
fr: Il n'y pas d'événement finale pour cette édition.

source: Organization
fr: Association

source: Enrollment
fr: Recrutement

source: Enrollment Form
fr: Formulaire de recrutement

source: Meal tickets
fr: Tickets repas

source: Misc
fr: Divers

source: Step %(step)s of %(total)s
fr: Étape %(step)s sur %(total)s

# Legend
source: Key
fr: Légende

source: Difficulty
fr: Difficulté

source: Problem name
fr: Problème

source: # of codes
fr: # de codes

source: Nickname
fr: Pseudonyme

source: Full name
fr: Nom complet

source: Manually unlocked
fr: Débloqué manuellement

source: No contestant found.
fr: Pas de candidat.

source: Contestant will <strong>not</strong> be imported.
fr: Le candidat ne sera <strong>pas</strong> importé.

source: Contestant will be imported.
fr: Le candidat sera importé.

source: Proceed
fr: Continuer

source: TeX generation failed
fr: Génération TeX avortée

source: The TeX generation failed with error <code>%(message)s</code>.
fr: La génération TeX a échoué avec l'erreur <code>%(message)s</code>.

source: The program exited with return code <code>%(code)s</code>.
fr: Le programme a quitté avec le code de retour <code>%(code)s</code>.

source: Standard output
fr: Sortie standard

source: Standard error
fr: Erreur standard

source: Prologin %(year)s: batch invitations to the regional center %(center)s
fr: Prologin %(year)s : lot de convocations pour le centre régional %(center)s

# Document filename
source: invitations-%(year)s-regional-%(center)s
fr: invitations-%(year)s-regionale-%(center)s

source: Prologin %(year)s: invitation to the regional event for %(fullname)s
fr: Prologin %(year)s : convocation à l'épreuve régionale pour %(fullname)s

# Document filename
source: invitation-%(year)s-regional-%(fullname)s
fr: invitations-%(year)s-regionale-%(fullname)s

source: Prologin %(year)s: call list for the regional center %(center)s
fr: Prologin %(year)s : liste d'appel pour le centre régional %(center)s

# Document filename
source: call-list-%(year)s-regional-%(center)s
fr: liste-appel-%(year)s-regionale-%(center)s

source: Prologin %(year)s: portrayal agreement for the regional events
fr: Prologin %(year)s : droit à l'image pour l'épreuve régionale

# Document filename
source: portrayal-agreement-%(year)s-regional
fr: droit-image-%(year)s-regionale

source: Prologin %(year)s: password sheets for the regional center %(center)s
fr: Prologin %(year)s: mots de passe pour le centre régional %(center)s

# Document filename
source: password-list-%(year)s-regional-%(center)s
fr: mots-de-passe-%(year)s-regionale-%(center)s

source: Prologin %(year)s: interview sheets for the regional center %(center)s
fr: Prologin %(year)s : feuilles d'interview pour le centre régional %(center)s

# Document filename
source: interviews-%(year)s-regional-%(center)s
fr: interviews-%(year)s-regionale-%(center)s

source: Prologin %(year)s: document compilation for regional events for %(fullname)s
fr: Prologin %(year)s : compilation de documents pour l'épreuve régionale pour %(fullname)s

# Document filename
source: prologin-%(year)s-regional-documents-%(fullname)s
fr: prologin-%(year)s-documents-regionale-%(fullname)s

source: Upload result file
fr: Envoyer le fichier de résultats

source: Review the imported data
fr: Vérifier les données importées

source: Contestant not found in local database.
fr: Candidat non trouvé dans la base de données locale.

source: Contestant not assigned to this regional event.
fr: Candidat non assigné à cette épreuve régionale.

source: User is inactive.
fr: L'utilisateur est inactif.

source: Contestant not found in imported data.
fr: Candidat non trouvé dans les données importée.

source: Successfully imported regional event results.
fr: Résultats de l'épreuve régionale importés avec succès.

source: Prologin %(year)s: batch invitations to the final
fr: Prologin %(year)s : lots de convocations pour la finale

# Document filename
source: invitations-%(year)s-final
fr: convocations-%(year)s-finale

source: Prologin %(year)s: invitation to the final for %(fullname)s
fr: Prologin %(year)s : convocation à la finale pour %(fullname)s

# Document filename
source: invitation-%(year)s-final-%(fullname)s
fr: convocation-%(year)s-finale-%(fullname)s

source: Prologin %(year)s: call list for the final
fr: Prologin %(year)s : liste d'appel pour la finale

# Document filename
source: call-list-%(year)s-final
fr: liste-appel-%(year)s-finale

source: Prologin %(year)s: password sheets for the final
fr: Prologin %(year)s : mots de passe pour la finale

# Document filename
source: password-list-%(year)s-final
fr: mots-de-passe-%(year)s-finale

source: Prologin %(year)s: external organizers
fr: Prologin %(year)s : organisateurs externes

# Document filename
source: external-organizers-%(year)s
fr: orgas-externes-%(year)s

source: Prologin %(year)s: portrayal agreement for the final
fr: Prologin %(year)s : droit à l'imagine pour la finale

# Document filename
source: portrayal-agreement-%(year)s-final
fr: droit-image-%(year)s-finale

source: Prologin %(year)s: participation authorization for the final
fr: Prologin %(year)s : autorisation de participation à la finale

# Document filename
source: participation-authorization-%(year)s-final
fr: autorisation-participation-finale-%(year)s
